# Contents

## 01 Import libraries and data

## 02 Check data

### 02.1 Initial consistency checks for data population flow

### 02.2 Check df_p1

### 02.3 Remarks for cleaning on df_p1

### 02.4 Check df_p2

### 02.5 Remarks for cleaning on df_p2

### 02.6 Check df_p3

### 02.7 Remarks for cleaning on df_p3

### 02.8 Check df_p4

### 02.9 Remarks for cleaning on df_p4

### 02.10 Check df_roll

### 02.11 Remarks for cleaning on df_roll

## 03 Data cleaning â€“ individual dataframes

### 03.1 Address mixed-type columns in df_p1

### 03.2 Address mixed-type columns in df_roll

### 03.3 Address column sale_price in all dataframes

### 03.4 Address column sale_date in all dataframes

### 03.5 Harmonise column datatypes in df_p1

### 03.6 Harmonise column datatypes in df_p2

### 03.7 Harmonise column datatypes in df_p3

### 03.8 Harmonise column datatypes in df_p4

### 03.9 Harmonise column datatypes in df_roll

## 04 Final check for mixed-type columns before merging

## 05 Merging all dataframes into one

## 06 Data cleaning - merged dataframe

### 06.1 Address duplicates

### 06.2 Check for missing values

### 06.3 Get descriptive statistics for columns with missing values

### 06.7 Create subsets with missing values

### 06.8 Address missing values

## 07 Creating flags

### 07.1 Sale prices == 0

### 07.2 Imputing borough names

## 08 Data consistency checks

### 08.1 Further cleaning to address inconsistencies

## 09 Basic descriptive statistics I

### 09.1 Further cleaning I based on insights from descriptive statistics

## 10 Basic descriptive statistics II

## 11 Drop columns that are irrelevant for the analysis

## 12 Export dataframes

# 01 Import libraries and data

In [256]:
# Import pandas, numpy, os
import pandas as pd
import numpy as np
import os

In [257]:
# Define path variable
path = r'/Users/DanielaDietmayr/Library/CloudStorage/OneDrive-Personal/2023-05-07_NYC property sales/02_Data/02_Prepared data/01_Ready for import'

In [258]:
# Change options to display all columns
pd.options.display.max_columns = None

In [259]:
# Import data
df_p1 = pd.read_csv(os.path.join(path, '2023-05-07_NYC prop sales 2003-23_P1.csv'), index_col = False)
df_p2 = pd.read_csv(os.path.join(path, '2023-05-07_NYC prop sales 2003-23_P2.csv'), index_col = False)
df_p3 = pd.read_csv(os.path.join(path, '2023-05-07_NYC prop sales 2003-23_P3.csv'), index_col = False)
df_p4 = pd.read_csv(os.path.join(path, '2023-05-07_NYC prop sales 2003-23_P4.csv'), index_col = False)
df_roll = pd.read_csv(os.path.join(path, '2023-05-07_NYC prop sales rolling.csv'), index_col = False)

/var/folders/xf/prw7mx913rn2xzxlywvr1_jc0000gn/T/ipykernel_44932/2658094689.py:6: DtypeWarning: Columns (1,2,3,7,8,9,18,19,20) have mixed types. Specify dtype option on import or set low_memory=False.
  df_roll = pd.read_csv(os.path.join(path, '2023-05-07_NYC prop sales rolling.csv'), index_col = False)

# 02 Check data

## 02.1 Initial consistency checks for data population flow

According to original data retrieved from NYC Depeartment of Finance website, no data is missing for column sale_date. The numbers of non-missing values for the five dataframes are expected to be as follows:
df_p1: 428903 (Jan 2018 - Dec 2022)
df_p2: 448573 (Jan 2013 - Dec 2017)
df_p3: 499739 (Jan 2007 - Dec 2012)
df_p4: 484134 (Jan 2003 - Dec 2006)
df_roll: 84391 (Apr 2022 - Mar 2023)

Shape of dataframes should hence be 21 columns and rows as indicated above.

In [260]:
# Get shape of df_p1
df_p1.shape

(428903, 21)

In [261]:
# Get shape of df_p2
df_p2.shape

(448573, 21)

In [262]:
# Get shape of df_p3
df_p3.shape

(499793, 21)

In [263]:
# Get shape of df_p4
df_p4.shape

(484134, 21)

In [264]:
# Get shape of df_roll
df_roll.shape

(359913, 21)

Dimensions of df_p1 - p4 are ok. Dimensions of df_roll point to 275522 unexpected rows.

In [265]:
# Check for missing values in sale_date in df_roll
df_roll['sale_date'].value_counts(dropna=False)

NaN         275522
30.06.22       700
28.04.22       589
21.06.22       567
12.07.22       563
             ...
22.01.23         2
06.11.22         2
03.07.22         2
16.10.22         2
17.04.22         2
Name: sale_date, Length: 366, dtype: int64

In [266]:
# Confirm number of missing values in sale_date
df_roll['sale_date'].isna().sum()

275522

In [267]:
# Drop rows with missing values in sale_date
df_roll.dropna(subset=['sale_date'], inplace=True)

In [268]:
# Confirm dropping of rows
df_roll['sale_date'].isna().sum()

0

In [269]:
df_roll.shape

(84391, 21)

Initial consistency check complete. Dimensions of five dataframes are now as expected according to original data provided by NYC Department of Finance.

## 02.2 Check df_p1

In [270]:
# Get info on df_p1
df_p1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 428903 entries, 0 to 428902
Data columns (total 21 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   borough                         428903 non-null  int64
 1   neighborhood                    428903 non-null  object
 2   building_class_category         428903 non-null  object
 3   tax_class_at_present            428336 non-null  object
 4   block                           428903 non-null  int64
 5   lot                             428903 non-null  int64
 6   easement                        0 non-null       float64
 7   building_class_at_present       428336 non-null  object
 8   address                         428903 non-null  object
 9   apartment_number                100295 non-null  object
 10  zip_code                        428868 non-null  float64
 11  residential_units               352121 non-null  float64
 12  commercial_units                315265 non-null  float64
 13  total_units                     358141 non-null  float64
 14  land_square_feet                309244 non-null  float64
 15  gross_square_feet               309245 non-null  float64
 16  year_built                      404878 non-null  float64
 17  tax_class_at_time_of_sale       428903 non-null  int64
 18  building_class_at_time_of_sale  428903 non-null  object
 19  sale_price                      428903 non-null  object
 20  sale_date                       428903 non-null  object
dtypes: float64(8), int64(4), object(9)
memory usage: 68.7+ MB

In [271]:
# Inspect head of df_p1
df_p1.head(5)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,7,NaN,A5,4732 AMBOY ROAD,NaN,"10,312.00",1.00,0.00,1.00,"3,654.00",910.00,"2,002.00",1,A5,"764,000.00",30.06.22
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,4,NaN,A1,26 EDWIN STREET,NaN,"10,312.00",1.00,0.00,1.00,"7,654.00","2,277.00","1,980.00",1,A1,"1,098,000.00",19.08.22
2,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,32,NaN,A1,541 SYCAMORE STREET,NaN,"10,312.00",1.00,0.00,1.00,"13,320.00","4,696.00","1,985.00",1,A1,0.00,20.04.22
3,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5399,37,NaN,A2,255 KOCH BOULEVARD,NaN,"10,312.00",1.00,0.00,1.00,"8,190.00","1,528.00","1,970.00",1,A2,"890,000.00",03.01.22
4,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5402,17,NaN,A2,6 WEAVER STREET,NaN,"10,312.00",1.00,0.00,1.00,"10,500.00","2,278.00","1,980.00",1,A2,0.00,27.12.22

In [272]:
# Check for mixed-type columns in df_p1
for col in df_p1.columns.tolist():
  weird = (df_p1[[col]].applymap(type) != df_p1[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_p1[weird]) > 0:
    print (col)

tax_class_at_present
building_class_at_present
apartment_number

## 02.3 Remarks for cleaning on df_p1
21 columns, 428903 rows.

Only borough number (not name) included.

Missing values imported as NaN. Missing values in columns: easement, building_class_at_present, apartment_number, zip_code, residential_units, commercial_units, total_units, land_square_feet, gross_square_feet, year_built.

ZIP code imported as floating point number.
Residential units imported as floating point number.
Commercial units imported as floating point number.
Total units imported as floating point number.
Year_built imported as floating point number.
Sale_price imported as string.
Sale_date imported as string.

Mixed-type columns are tax class at present, building class at present, and apartment number.

## 02.4 Check df_p2

In [273]:
# Get info on df_p2
df_p2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 448573 entries, 0 to 448572
Data columns (total 21 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   borough                         448573 non-null  int64
 1   neighborhood                    448573 non-null  object
 2   building_class_category         448573 non-null  object
 3   tax_class_at_present            448573 non-null  object
 4   block                           448573 non-null  int64
 5   lot                             448573 non-null  int64
 6   easement                        448573 non-null  object
 7   building_class_at_present       448573 non-null  object
 8   address                         448573 non-null  object
 9   apartment_number                448573 non-null  object
 10  zip_code                        448573 non-null  int64
 11  residential_units               448573 non-null  int64
 12  commercial_units                448573 non-null  int64
 13  total_units                     448573 non-null  int64
 14  land_square_feet                448573 non-null  float64
 15  gross_square_feet               448573 non-null  float64
 16  year_built                      448573 non-null  int64
 17  tax_class_at_time_of_sale       448573 non-null  int64
 18  building_class_at_time_of_sale  448573 non-null  object
 19  sale_price                      448573 non-null  object
 20  sale_date                       448573 non-null  object
dtypes: float64(2), int64(9), object(10)
memory usage: 71.9+ MB

In [274]:
# Inspect head of df_p2
df_p2.head(5)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,9,,A5,4726 AMBOY ROAD,,10312,1,0,1,"3,067.00","1,110.00",2002,1,A5,"520,000.00",21.04.16
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,30,,A1,1306 ARDEN AVENUE,,10312,1,0,1,"7,500.00","1,890.00",1952,1,A1,0.00,04.05.16
2,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,15,,A1,10 EDWIN STREET,,10312,1,0,1,"7,000.00","2,200.00",1980,1,A1,10.00,21.04.16
3,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5397,60,,A1,33 EYLANDT STREET,,10312,1,0,1,"10,120.00","3,516.00",1984,1,A1,0.00,10.08.16
4,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5399,26,,A1,235 KOCH BOULEVARD,,10312,1,0,1,"9,555.00","1,528.00",1960,1,A1,0.00,11.02.16

In [275]:
# Check for mixed-type columns in df_p2
for col in df_p2.columns.tolist():
  weird = (df_p2[[col]].applymap(type) != df_p2[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_p2[weird]) > 0:
    print (col)

## 02.5 Remarks for cleaning on df_p2
21 columns, 448573 rows.

Only borough number (not name) included.

Missing values remain missing (not imported as NaN, but also identified as non-null).

Sale_price imported as string. Sale_date imported as string.

No mixed-type columns.

## 02.6 Check df_p3

In [276]:
# Get info on df_p3
df_p3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499793 entries, 0 to 499792
Data columns (total 21 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   borough                         499793 non-null  int64
 1   neighborhood                    499793 non-null  object
 2   building_class_category         499793 non-null  object
 3   tax_class_at_present            499793 non-null  object
 4   block                           499793 non-null  int64
 5   lot                             499793 non-null  int64
 6   easement                        499793 non-null  object
 7   building_class_at_present       499793 non-null  object
 8   address                         499793 non-null  object
 9   apartment_number                499793 non-null  object
 10  zip_code                        499793 non-null  int64
 11  residential_units               499793 non-null  int64
 12  commercial_units                499793 non-null  int64
 13  total_units                     499793 non-null  int64
 14  land_square_feet                499793 non-null  float64
 15  gross_square_feet               499793 non-null  float64
 16  year_built                      499793 non-null  int64
 17  tax_class_at_time_of_sale       499793 non-null  int64
 18  building_class_at_time_of_sale  499793 non-null  object
 19  sale_price                      499793 non-null  object
 20  sale_date                       499793 non-null  object
dtypes: float64(2), int64(9), object(10)
memory usage: 80.1+ MB

In [277]:
# Inspect head of df_p3
df_p3.head(5)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY HOMES,1,5395,32,,A1,541 SYCAMORE STREET,,10312,1,0,1,"13,320.00","4,696.00",1985,1,A1,"1,200,000.00",15.08.12
1,5,ANNADALE,01 ONE FAMILY HOMES,1,5401,38,,A1,27 WEAVER STREET,,10312,1,0,1,"10,833.00","2,128.00",1980,1,A1,"127,500.00",26.09.12
2,5,ANNADALE,01 ONE FAMILY HOMES,1,5402,43,,A1,295 HAROLD AVENUE,,10312,1,0,1,"6,700.00","3,348.00",1980,1,A1,"600,000.00",31.05.12
3,5,ANNADALE,01 ONE FAMILY HOMES,1,5407,11,,A1,24 ELMBANK STREET,,10312,1,0,1,"5,000.00","1,520.00",1910,1,A1,"237,276.00",29.11.12
4,5,ANNADALE,01 ONE FAMILY HOMES,1,6205,23,,A5,81 EAGAN AVENUE,,10312,1,0,1,"1,546.00","1,579.00",1986,1,A5,"322,500.00",19.03.12

In [278]:
# Check for mixed-type columns in df_p3
for col in df_p3.columns.tolist():
  weird = (df_p3[[col]].applymap(type) != df_p3[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_p3[weird]) > 0:
    print (col)

## 02.7 Remarks for cleaning on df_p3
21 columns, 499793 rows.

Only borough number (not name) included.

Missing values remain missing (not imported as NaN, but also identified as non-null).

Sale_price imported as string. Sale_date imported as string.

No mixed-type columns.

## 02.8 Check df_p4

In [279]:
# Get info on df_p4
df_p4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 484134 entries, 0 to 484133
Data columns (total 21 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   borough                         484134 non-null  int64
 1   neighborhood                    484134 non-null  object
 2   building_class_category         484134 non-null  object
 3   tax_class_at_present            484134 non-null  object
 4   block                           484134 non-null  int64
 5   lot                             484134 non-null  int64
 6   easement                        484134 non-null  object
 7   building_class_at_present       484134 non-null  object
 8   address                         484134 non-null  object
 9   apartment_number                484134 non-null  object
 10  zip_code                        484134 non-null  int64
 11  residential_units               484134 non-null  int64
 12  commercial_units                484134 non-null  int64
 13  total_units                     484134 non-null  int64
 14  land_square_feet                484134 non-null  float64
 15  gross_square_feet               484134 non-null  float64
 16  year_built                      484134 non-null  int64
 17  tax_class_at_time_of_sale       484134 non-null  int64
 18  building_class_at_time_of_sale  484134 non-null  object
 19  sale_price                      484134 non-null  object
 20  sale_date                       484134 non-null  object
dtypes: float64(2), int64(9), object(10)
memory usage: 77.6+ MB

In [280]:
# Inspect head of df_p4
df_p4.head(5)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY HOMES,1,5394,8,,A1,16 FINGAL STREET,,10312,1,0,1,"10,000.00","5,163.00",1985,1,A1,"1,360,000.00",21.07.06
1,5,ANNADALE,01 ONE FAMILY HOMES,1,5395,4,,A1,26 EDWIN STREET,,10312,1,0,1,"7,654.00","2,277.00",1980,1,A1,"900,000.00",05.09.06
2,5,ANNADALE,01 ONE FAMILY HOMES,1,5395,19,,A1,4 EDWIN STREET,,10312,1,0,1,"7,258.00","2,230.00",1980,1,A1,"785,000.00",21.07.06
3,5,ANNADALE,01 ONE FAMILY HOMES,1,5396,46,,A1,31 TALLMAN STREET,,10312,1,0,1,"10,080.00","4,400.00",1991,1,A1,"1,200,000.00",27.09.06
4,5,ANNADALE,01 ONE FAMILY HOMES,1,5397,7,,A1,20 TALLMAN STREET,,10312,1,0,1,"10,800.00","4,157.00",1984,1,A1,"1,094,500.00",12.05.06

In [281]:
# Check for mixed-type columns in df_p4
for col in df_p4.columns.tolist():
  weird = (df_p4[[col]].applymap(type) != df_p4[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_p4[weird]) > 0:
    print (col)

## 02.9 Remarks for cleaning on df_p4
21 columns, 484134 rows.

Only borough number (not name) included.

Missing values remain missing (not imported as NaN, but also identified as non-null).

Sale_price imported as string. Sale_date imported as string.

No mixed-type columns.

## 02.10 Check df_roll

In [282]:
# Get info on df_roll
df_roll.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 84391 entries, 0 to 84390
Data columns (total 21 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   borough                         84391 non-null  float64
 1   neighborhood                    84391 non-null  object
 2   building_class_category         84391 non-null  object
 3   tax_class_at_present            84310 non-null  object
 4   block                           84391 non-null  float64
 5   lot                             84391 non-null  float64
 6   easement                        0 non-null      float64
 7   building_class_at_present       84310 non-null  object
 8   address                         84391 non-null  object
 9   apartment_number                21338 non-null  object
 10  zip_code                        84384 non-null  float64
 11  residential_units               63144 non-null  float64
 12  commercial_units                47138 non-null  float64
 13  total_units                     65877 non-null  float64
 14  land_square_feet                44405 non-null  float64
 15  gross_square_feet               44405 non-null  float64
 16  year_built                      78883 non-null  float64
 17  tax_class_at_time_of_sale       84391 non-null  float64
 18  building_class_at_time_of_sale  84391 non-null  object
 19  sale_price                      84391 non-null  object
 20  sale_date                       84391 non-null  object
dtypes: float64(12), object(9)
memory usage: 14.2+ MB

In [283]:
# Inspect head of df_roll
df_roll.head(5)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5.00,ANNADALE,01 ONE FAMILY DWELLINGS,1,"5,391.00",7.00,NaN,A5,4732 AMBOY ROAD,NaN,"10,312.00",1.00,0.00,1.00,"3,655.00",910.00,"2,002.00",1.00,A5,"764,000.00",30.06.22
1,5.00,ANNADALE,01 ONE FAMILY DWELLINGS,1,"5,395.00",4.00,NaN,A1,26 EDWIN STREET,NaN,"10,312.00",1.00,0.00,1.00,"7,654.00","2,277.00","1,980.00",1.00,A1,"1,098,000.00",19.08.22
2,5.00,ANNADALE,01 ONE FAMILY DWELLINGS,1,"5,395.00",32.00,NaN,A1,541 SYCAMORE STREET,NaN,"10,312.00",1.00,0.00,1.00,"13,320.00","4,696.00","1,985.00",1.00,A1,0.00,20.04.22
3,5.00,ANNADALE,01 ONE FAMILY DWELLINGS,1,"5,396.00",41.00,NaN,A1,21 TALLMAN STREET,NaN,"10,312.00",1.00,0.00,1.00,"9,968.00","3,940.00","1,990.00",1.00,A1,"1,275,000.00",17.03.23
4,5.00,ANNADALE,01 ONE FAMILY DWELLINGS,1,"5,401.00",42.00,NaN,A2,265 HAROLD AVENUE,NaN,"10,312.00",1.00,0.00,1.00,"8,190.00","2,100.00","1,980.00",1.00,A2,"385,000.00",16.02.23

In [284]:
# Check for mixed-type columns in df_roll
for col in df_roll.columns.tolist():
  weird = (df_roll[[col]].applymap(type) != df_roll[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_roll[weird]) > 0:
    print (col)

tax_class_at_present
building_class_at_present
apartment_number

## 02.11 Remarks for cleaning on df_roll
21 columns, 84391 rows.

Missing values imported as NaN. Missing values in: tax_class_at_present, easement, building_class_at_present, apartment_number, zip_code, residential_units, commercial_units, total_units, land_square_feet, cross_square_feet, year_built

Borough imported as floating point number.
Only borough number (not name) included.
Block imported as floating point number.
Lot imported as floating point number.
ZIP code imported as floating point number.
Residential units imported as floating point number.
Commercial units imported as floating point number.
Total units imported as floating point number.
Year built imported as floating point number.
Tax class at time of sale imported as floating point number.
Sale_price imported as string. 
Sale_date imported as string.

Mixed type columns are tax class at present, building class at present, apartment number.

# 03 Data cleaning - individual dataframes

## 03.1 Address mixed-type columns in df_p1

In [285]:
# Fix mixed data types in df_p1
df_p1['tax_class_at_present'] = df_p1['tax_class_at_present'].astype('str')
df_p1['building_class_at_present'] = df_p1['building_class_at_present'].astype('str')
df_p1['apartment_number'] = df_p1['apartment_number'].astype('str')

In [286]:
# Check for fixing mixed-type columns in df_p1
for col in df_p1.columns.tolist():
  weird = (df_p1[[col]].applymap(type) != df_p1[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_p1[weird]) > 0:
    print (col)

No mixed-type columns remain in df_p1.

## 03.2 Address mixed-type columns in df_roll

In [287]:
# Fix mixed data types in df_roll
df_roll['tax_class_at_present'] = df_roll['tax_class_at_present'].astype('str')
df_roll['building_class_at_present'] = df_roll['building_class_at_present'].astype('str')
df_roll['apartment_number'] = df_roll['apartment_number'].astype('str')

In [288]:
# Check again for mixed-type columns in df_roll
for col in df_roll.columns.tolist():
  weird = (df_roll[[col]].applymap(type) != df_roll[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_roll[weird]) > 0:
    print (col)

No mixed-type columns remain in df_roll.

## 03.3 Address column sale_price in all dataframes

In [289]:
# Remove commas from column sale_price to prepare for conversion to floating point number
df_p1['sale_price'] = df_p1['sale_price'].str.replace(',','')
df_p2['sale_price'] = df_p2['sale_price'].str.replace(',','')
df_p3['sale_price'] = df_p3['sale_price'].str.replace(',','')
df_p4['sale_price'] = df_p4['sale_price'].str.replace(',','')
df_roll['sale_price'] = df_roll['sale_price'].str.replace(',','')

In [290]:
# Convert sale_price to floating point number
df_p1['sale_price'] = df_p1['sale_price'].astype('float')
df_p2['sale_price'] = df_p2['sale_price'].astype('float')
df_p3['sale_price'] = df_p3['sale_price'].astype('float')
df_p4['sale_price'] = df_p4['sale_price'].astype('float')
df_roll['sale_price'] = df_roll['sale_price'].astype('float')

In [291]:
# Check whether data type for sale_price was converted for df_p1
df_p1['sale_price'].dtype

dtype('float64')

In [292]:
# Check whether data type for sale_price was converted for df_p2
df_p2['sale_price'].dtype

dtype('float64')

In [293]:
# Check whether data type for sale_price was converted for df_p3
df_p3['sale_price'].dtype

dtype('float64')

In [294]:
# Check whether data type for sale_price was converted for df_p4
df_p4['sale_price'].dtype

dtype('float64')

In [295]:
# Check whether data type for sale_price was converted for df_roll
df_roll['sale_price'].dtype

dtype('float64')

In [296]:
# Check how values in df_p1 look after conversion of sale_price
df_p1.head(2)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,7,NaN,A5,4732 AMBOY ROAD,nan,"10,312.00",1.00,0.00,1.00,"3,654.00",910.00,"2,002.00",1,A5,"764,000.00",30.06.22
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,4,NaN,A1,26 EDWIN STREET,nan,"10,312.00",1.00,0.00,1.00,"7,654.00","2,277.00","1,980.00",1,A1,"1,098,000.00",19.08.22

In [297]:
# Check how values in df_p2 look after conversion of sale_price
df_p2.head(2)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,9,,A5,4726 AMBOY ROAD,,10312,1,0,1,"3,067.00","1,110.00",2002,1,A5,"520,000.00",21.04.16
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,30,,A1,1306 ARDEN AVENUE,,10312,1,0,1,"7,500.00","1,890.00",1952,1,A1,0.00,04.05.16

In [298]:
# Check how values in df_p3 look after conversion of sale_price
df_p3.head(2)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY HOMES,1,5395,32,,A1,541 SYCAMORE STREET,,10312,1,0,1,"13,320.00","4,696.00",1985,1,A1,"1,200,000.00",15.08.12
1,5,ANNADALE,01 ONE FAMILY HOMES,1,5401,38,,A1,27 WEAVER STREET,,10312,1,0,1,"10,833.00","2,128.00",1980,1,A1,"127,500.00",26.09.12

In [299]:
# Check how values in df_p4 look after conversion of sale_price
df_p4.head(2)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY HOMES,1,5394,8,,A1,16 FINGAL STREET,,10312,1,0,1,"10,000.00","5,163.00",1985,1,A1,"1,360,000.00",21.07.06
1,5,ANNADALE,01 ONE FAMILY HOMES,1,5395,4,,A1,26 EDWIN STREET,,10312,1,0,1,"7,654.00","2,277.00",1980,1,A1,"900,000.00",05.09.06

In [300]:
# Check how values in df_roll look after conversion of sale_price
df_roll.head(2)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5.00,ANNADALE,01 ONE FAMILY DWELLINGS,1,"5,391.00",7.00,NaN,A5,4732 AMBOY ROAD,nan,"10,312.00",1.00,0.00,1.00,"3,655.00",910.00,"2,002.00",1.00,A5,"764,000.00",30.06.22
1,5.00,ANNADALE,01 ONE FAMILY DWELLINGS,1,"5,395.00",4.00,NaN,A1,26 EDWIN STREET,nan,"10,312.00",1.00,0.00,1.00,"7,654.00","2,277.00","1,980.00",1.00,A1,"1,098,000.00",19.08.22

Columns sale_price in all dataframes converted.

## 03.4 Address column sale_date in all dataframes

In [301]:
# Convert sale_date to datetime
df_p1['sale_date'] = pd.to_datetime(df_p1['sale_date'], format='%d.%m.%y')
df_p2['sale_date'] = pd.to_datetime(df_p2['sale_date'], format='%d.%m.%y')
df_p3['sale_date'] = pd.to_datetime(df_p3['sale_date'], format='%d.%m.%y')
df_p4['sale_date'] = pd.to_datetime(df_p4['sale_date'], format='%d.%m.%y')
df_roll['sale_date'] = pd.to_datetime(df_roll['sale_date'], format='%d.%m.%y')

In [302]:
# Get minimum sale_date in df_p1 (expected: 01/01/2018)
df_p1['sale_date'].min()

Timestamp('2018-01-01 00:00:00')

In [303]:
# Get maximum sale_date in df_p1 (expected: 31/12/2022)
df_p1['sale_date'].max()

Timestamp('2022-12-31 00:00:00')

In [304]:
# Get minimum sale_date in df_p2 (expected: 01/01/2013)
df_p2['sale_date'].min()

Timestamp('2013-01-01 00:00:00')

In [305]:
# Get maximum sale_date in df_p2 (expected: 31/12/2017)
df_p2['sale_date'].max()

Timestamp('2017-12-31 00:00:00')

In [306]:
# Get minimum sale_date in df_p3 (expected: 01/01/2007)
df_p3['sale_date'].min()

Timestamp('2007-01-01 00:00:00')

In [307]:
# Get maximum sale_date in df_p3 (expected: 31/12/2012)
df_p3['sale_date'].max()

Timestamp('2012-12-31 00:00:00')

In [308]:
# Get minimum sale_date in df_p4 (expected: 01/01/2003)
df_p4['sale_date'].min()

Timestamp('2003-01-01 00:00:00')

In [309]:
# Get maximum sale_date in df_p4 (expected: 31/12/2006)
df_p4['sale_date'].max()

Timestamp('2006-12-31 00:00:00')

In [310]:
# Get minimum sale_date in df_roll (expected: 01/04/2022)
df_roll['sale_date'].min()

Timestamp('2022-04-01 00:00:00')

In [311]:
# Get maximum sale_date in df_roll (expected: 31/03/2023)
df_roll['sale_date'].max()

Timestamp('2023-03-31 00:00:00')

In [312]:
# Get sale_date datatype in df_p1
df_p1['sale_date'].dtypes

dtype('<M8[ns]')

In [313]:
# Get sale_date datatype in df_p2
df_p2['sale_date'].dtypes

dtype('<M8[ns]')

In [314]:
# Get sale_date datatype in df_p3
df_p3['sale_date'].dtypes

dtype('<M8[ns]')

In [315]:
# Get sale_date datatype in df_p4
df_p4['sale_date'].dtypes

dtype('<M8[ns]')

In [316]:
# Get sale_date datatype in df_roll
df_roll['sale_date'].dtypes

dtype('<M8[ns]')

Columns sale_date in all dataframes converted, minimum and maximum dates as expected.

## 03.5 Harmonise column datatypes in df_p1

In [317]:
# Recall datatypes in df_p1
df_p1.dtypes

borough                                    int64
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                      int64
lot                                        int64
easement                                 float64
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                 float64
residential_units                        float64
commercial_units                         float64
total_units                              float64
land_square_feet                         float64
gross_square_feet                        float64
year_built                               float64
tax_class_at_time_of_sale                  int64
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

In [318]:
# Convert borough, block and lot to string
df_p1['borough'] = df_p1['borough'].astype('str')
df_p1['block'] = df_p1['block'].astype('str')
df_p1['lot'] = df_p1['lot'].astype('str')

# Convert easement to string
df_p1['easement'] = df_p1['easement'].astype('str').str[:-2]

# Convert zip_code to int
df_p1['zip_code'] = df_p1['zip_code'].astype(int, errors='ignore')

# Convert columns on numbers of units to int
df_p1['residential_units'] = df_p1['residential_units'].astype(int, errors='ignore')
df_p1['commercial_units'] = df_p1['commercial_units'].astype(int, errors='ignore')
df_p1['total_units'] = df_p1['total_units'].astype(int, errors='ignore')

# Convert year_built to int
df_p1['year_built'] = df_p1['year_built'].astype(int, errors='ignore')

# Convert tax_class_at_time_of_sale to string
df_p1['tax_class_at_time_of_sale'] = df_p1['tax_class_at_time_of_sale'].astype('str')

In [319]:
# Check whether conversion has worked
df_p1.dtypes

borough                                   object
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                     object
lot                                       object
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                 float64
residential_units                        float64
commercial_units                         float64
total_units                              float64
land_square_feet                         float64
gross_square_feet                        float64
year_built                               float64
tax_class_at_time_of_sale                 object
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

Conversion has not worked for zip_code, residential_units, commercial_units, total_units and year_built.

In [320]:
# Check zip_code for missing values
df_p1['zip_code'].isna().sum()

35

In [321]:
# Change options to display 10+ rows when printing a dataframe
pd.options.display.max_rows = None

In [322]:
# Inspect rows with missing values for zip_code
print(df_p1.loc[df_p1['zip_code'].isna()])

       borough              neighborhood            building_class_category  \
591          5                BLOOMFIELD          31 COMMERCIAL VACANT LAND
5479         5             OAKWOOD-BEACH         05 TAX CLASS 1 VACANT LAND
8869         4                   ARVERNE              29 COMMERCIAL GARAGES
83458        3              SPRING CREEK         05 TAX CLASS 1 VACANT LAND
83459        3              SPRING CREEK         05 TAX CLASS 1 VACANT LAND
83460        3              SPRING CREEK         05 TAX CLASS 1 VACANT LAND
83461        3              SPRING CREEK         05 TAX CLASS 1 VACANT LAND
99726        5             OAKWOOD-BEACH         05 TAX CLASS 1 VACANT LAND
193328       5                BULLS HEAD         05 TAX CLASS 1 VACANT LAND
193329       5                BULLS HEAD         05 TAX CLASS 1 VACANT LAND
193330       5                BULLS HEAD         05 TAX CLASS 1 VACANT LAND
193331       5                BULLS HEAD         05 TAX CLASS 1 VACANT LAND
193332       5                BULLS HEAD         05 TAX CLASS 1 VACANT LAND
193333       5                BULLS HEAD         05 TAX CLASS 1 VACANT LAND
193334       5                BULLS HEAD         05 TAX CLASS 1 VACANT LAND
193335       5                BULLS HEAD         05 TAX CLASS 1 VACANT LAND
197369       5           PLEASANT PLAINS         05 TAX CLASS 1 VACANT LAND
197765       5               PRINCES BAY         05 TAX CLASS 1 VACANT LAND
249531       3                OCEAN HILL              29 COMMERCIAL GARAGES
266344       5             OAKWOOD-BEACH         05 TAX CLASS 1 VACANT LAND
266345       5             OAKWOOD-BEACH         05 TAX CLASS 1 VACANT LAND
267936       5               SOUTH BEACH         05 TAX CLASS 1 VACANT LAND
268539       5               TOTTENVILLE          31 COMMERCIAL VACANT LAND
268540       5               TOTTENVILLE          31 COMMERCIAL VACANT LAND
268541       5               TOTTENVILLE          31 COMMERCIAL VACANT LAND
269785       4                   ARVERNE         05 TAX CLASS 1 VACANT LAND
269786       4                   ARVERNE         05 TAX CLASS 1 VACANT LAND
269787       4                   ARVERNE         05 TAX CLASS 1 VACANT LAND
269788       4                   ARVERNE         05 TAX CLASS 1 VACANT LAND
269790       4                   ARVERNE         05 TAX CLASS 1 VACANT LAND
269791       4                   ARVERNE         05 TAX CLASS 1 VACANT LAND
293795       4       SPRINGFIELD GARDENS                21 OFFICE BUILDINGS
339338       2  KINGSBRIDGE HTS/UNIV HTS         05 TAX CLASS 1 VACANT LAND
399782       3        BEDFORD STUYVESANT  15 CONDOS - 2-10 UNIT RESIDENTIAL
399783       3        BEDFORD STUYVESANT  15 CONDOS - 2-10 UNIT RESIDENTIAL

       tax_class_at_present  block   lot easement building_class_at_present  \
591                       4   1790   120        n                        V1
5479                     1B   4785     1        n                        V0
8869                      4  16013     1        n                        G7
83458                    1B   4585   165        n                        V0
83459                    1B   4585   167        n                        V0
83460                    1B   4585   205        n                        V0
83461                    1B   4585   225        n                        V0
99726                    1B   4787     2        n                        V3
193328                   1B   1547     1        n                        V0
193329                   1B   1547     1        n                        V0
193330                   1B   1547     2        n                        V0
193331                   1B   1547     2        n                        V0
193332                   1B   1547     3        n                        V0
193333                   1B   1547     3        n                        V0
193334                   1B   1547     4        n                        V0
193335                   1B   1547     4        n                        V0
197369                   1B   7757     4        n                        V0
197765                   1B   6660     1        n                        V0
249531                    4   1555    19        n                        G7
266344                   1B   4693     9        n                        V0
266345                   1B   4693     9        n                        V0
267936                   1B   3414    30        n                        V0
268539                    4   7987     1        n                        V1
268540                    4   7987     5        n                        V1
268541                    4   7987    15        n                        V1
269785                   1B  15970    24        n                        V0
269786                   1B  15970    25        n                        V0
269787                   1B  15970    27        n                        V0
269788                   1B  15970    32        n                        V0
269790                   1B  16014     1        n                        V0
269791                   1B  16014    22        n                        V0
293795                    4  15007    80        n                        O5
339338                   1B   3231   265        n                        V0
399782                  nan   1803  1002        n                       nan
399783                  nan   1803  1007        n                       nan

                        address apartment_number  zip_code  \
591             N/A GULF AVENUE              nan       NaN
5479       N/A PROMENADE AVENUE              nan       NaN
8869    N/A BEACH CHANNEL DRIVE              nan       NaN
83458       N/A VANDALIA AVENUE              nan       NaN
83459       N/A VANDALIA AVENUE              nan       NaN
83460           N/A DREW STREET              nan       NaN
83461           N/A DREW STREET              nan       NaN
99726      N/A GREAT KILLS LANE              nan       NaN
193328     N/A CROCHERON AVENUE              nan       NaN
193329     N/A CROCHERON AVENUE              nan       NaN
193330     N/A CROCHERON AVENUE              nan       NaN
193331     N/A CROCHERON AVENUE              nan       NaN
193332     N/A CROCHERON AVENUE              nan       NaN
193333     N/A CROCHERON AVENUE              nan       NaN
193334     N/A CROCHERON AVENUE              nan       NaN
193335     N/A CROCHERON AVENUE              nan       NaN
197369         N/A DAMON STREET              nan       NaN
197765        N/A HOLTEN AVENUE              nan       NaN
249531      N/A HERKIMER STREET              nan       NaN
266344       N/A DUGDALE STREET              nan       NaN
266345       N/A DUGDALE STREET              nan       NaN
267936        N/A QUINCY AVENUE              nan       NaN
268539         N/A ELLIS STREET              nan       NaN
268540         N/A ELLIS STREET              nan       NaN
268541         N/A ELLIS STREET              nan       NaN
269785        N/A NORTON AVENUE              nan       NaN
269786        N/A NORTON AVENUE              nan       NaN
269787        N/A NORTON AVENUE              nan       NaN
269788        N/A NORTON AVENUE              nan       NaN
269790  N/A BEACH CHANNEL DRIVE              nan       NaN
269791  N/A BEACH CHANNEL DRIVE              nan       NaN
293795       154-06 145TH DRIVE              nan       NaN
339338    N/A WEST FORDHAM ROAD              nan       NaN
399782     762 MARCY AVENUE; 1B              nan       NaN
399783      762 MARCY AVENUE; 4              nan       NaN

          residential_units     commercial_units          total_units  \
591                    0.00                 0.00                 0.00
5479                   0.00                 0.00                 0.00
8869                   0.00                 0.00                 0.00
83458                  0.00                 0.00                 0.00
83459                  0.00                 0.00                 0.00
83460                  0.00                 0.00                 0.00
83461                  0.00                 0.00                 0.00
99726                  0.00                 0.00                 0.00
193328                 0.00                 0.00                 0.00
193329                 0.00                 0.00                 0.00
193330                 0.00                 0.00                 0.00
193331                 0.00                 0.00                 0.00
193332                 0.00                 0.00                 0.00
193333                 0.00                 0.00                 0.00
193334                 0.00                 0.00                 0.00
193335                 0.00                 0.00                 0.00
197369                 0.00                 0.00                 0.00
197765                 0.00                 0.00                 0.00
249531                 0.00                 0.00                 0.00
266344                 0.00                 0.00                 0.00
266345                 0.00                 0.00                 0.00
267936                 0.00                 0.00                 0.00
268539                 0.00                 0.00                 0.00
268540                 0.00                 0.00                 0.00
268541                 0.00                 0.00                 0.00
269785                 0.00                 0.00                 0.00
269786                 0.00                 0.00                 0.00
269787                 0.00                 0.00                 0.00
269788                 0.00                 0.00                 0.00
269790                 0.00                 0.00                 0.00
269791                 0.00                 0.00                 0.00
293795                 0.00                 1.00                 1.00
339338                 0.00                 0.00                 0.00
399782                  NaN                  NaN                  NaN
399783                  NaN                  NaN                  NaN

           land_square_feet    gross_square_feet           year_built  \
591               17,808.00                 0.00                  NaN
5479              28,979.00                 0.00                  NaN
8869              32,938.00                 0.00                  NaN
83458             81,867.00                 0.00                  NaN
83459              6,439.00                 0.00                  NaN
83460              1,639.00                 0.00                  NaN
83461              2,582.00                 0.00                  NaN
99726                180.00                 0.00                  NaN
193328               410.00                 0.00                  NaN
193329               410.00                 0.00                  NaN
193330             1,050.00                 0.00                  NaN
193331             1,050.00                 0.00                  NaN
193332             1,209.00                 0.00                  NaN
193333             1,209.00                 0.00                  NaN
193334             1,417.00                 0.00                  NaN
193335             1,417.00                 0.00                  NaN
197369             4,000.00                 0.00                  NaN
197765           751,666.00                 0.00                  NaN
249531             4,900.00                 0.00                  NaN
266344             3,015.00                 0.00                  NaN
266345             3,015.00                 0.00                  NaN
267936             7,140.00                 0.00                  NaN
268539           154,240.00                 0.00                  NaN
268540           208,533.00                 0.00                  NaN
268541           189,321.00                 0.00                  NaN
269785             3,125.00                 0.00                  NaN
269786             5,946.00                 0.00                  NaN
269787            11,892.00                 0.00                  NaN
269788            11,892.00                 0.00                  NaN
269790            75,266.00                 0.00                  NaN
269791            10,298.00                 0.00                  NaN
293795            33,862.00            45,400.00             1,991.00
339338           162,200.00                 0.00                  NaN
399782                  NaN                  NaN                  NaN
399783                  NaN                  NaN                  NaN

       tax_class_at_time_of_sale building_class_at_time_of_sale  \
591                            4                             V1
5479                           1                             V0
8869                           4                             G7
83458                          1                             V0
83459                          1                             V0
83460                          1                             V0
83461                          1                             V0
99726                          1                             V3
193328                         1                             V0
193329                         1                             V0
193330                         1                             V0
193331                         1                             V0
193332                         1                             V0
193333                         1                             V0
193334                         1                             V0
193335                         1                             V0
197369                         1                             V0
197765                         1                             V0
249531                         4                             G7
266344                         1                             V0
266345                         1                             V0
267936                         1                             V0
268539                         4                             V1
268540                         4                             V1
268541                         4                             V1
269785                         1                             V0
269786                         1                             V0
269787                         1                             V0
269788                         1                             V0
269790                         1                             V0
269791                         1                             V0
293795                         4                             O5
339338                         1                             V0
399782                         2                             R1
399783                         2                             R1

                 sale_price  sale_date
591                3,333.00 2022-03-25
5479                   0.00 2022-11-10
8869           4,000,000.00 2022-07-18
83458            163,500.00 2022-10-06
83459            163,500.00 2022-10-06
83460             44,000.00 2022-06-28
83461            163,500.00 2022-10-06
99726                  0.00 2021-12-15
193328                 0.00 2020-12-23
193329                 0.00 2020-12-24
193330                 0.00 2020-12-23
193331                 0.00 2020-12-24
193332                 0.00 2020-12-23
193333                 0.00 2020-12-24
193334                 0.00 2020-12-23
193335                 0.00 2020-12-24
197369                 0.00 2020-12-31
197765                 0.00 2020-12-23
249531         1,300,000.00 2020-11-24
266344            27,500.00 2019-09-10
266345            24,034.00 2019-01-09
267936           264,000.00 2019-05-13
268539         3,500,000.00 2019-04-01
268540         3,500,000.00 2019-04-01
268541         3,500,000.00 2019-04-01
269785           106,000.00 2019-06-18
269786           491,000.00 2019-06-18
269787           491,000.00 2019-06-18
269788           561,000.00 2019-06-18
269790                 0.00 2019-06-14
269791                 0.00 2019-06-14
293795        48,602,987.00 2019-08-29
339338        31,550,000.00 2019-04-02
399782           850,000.00 2018-12-18
399783           875,000.00 2018-12-27

Theoretically, missing zip codes could be imputed by deducing the correct zip code from the address. However, this is only possible in cases where the full address is available (only 3/35 cases). Furthermore, zip codes won't be crucial for gaining insights (instead neighborhoods and boroughs are crucial). Therefore, missing values will be imputed as 0.

In [323]:
# Imputing 0 for missing values in zip_code
df_p1['zip_code'].fillna(0, inplace=True)

In [324]:
# Check whether missing values were imputed
df_p1['zip_code'].isna().sum()

0

In [325]:
# Check residential_units for missing values
df_p1['residential_units'].isna().sum()

76782

In [326]:
# Change options to display max rows when printing a dataframe
pd.options.display.max_rows = 30

In [327]:
# Inspect some rows with missing values for residential_units
print(df_p1.loc[df_p1['residential_units'].isna()])

       borough          neighborhood            building_class_category  \
199          5              ANNADALE           46 CONDO STORE BUILDINGS
200          5              ANNADALE           46 CONDO STORE BUILDINGS
573          5  ARROCHAR-SHORE ACRES     10 COOPS - ELEVATOR APARTMENTS
574          5  ARROCHAR-SHORE ACRES     10 COOPS - ELEVATOR APARTMENTS
575          5  ARROCHAR-SHORE ACRES     10 COOPS - ELEVATOR APARTMENTS
...        ...                   ...                                ...
401843       3          BOROUGH PARK  15 CONDOS - 2-10 UNIT RESIDENTIAL
402413       3        BRIGHTON BEACH  15 CONDOS - 2-10 UNIT RESIDENTIAL
402414       3        BRIGHTON BEACH  15 CONDOS - 2-10 UNIT RESIDENTIAL
419658       3  WILLIAMSBURG-CENTRAL    13 CONDOS - ELEVATOR APARTMENTS
420166       3    WILLIAMSBURG-NORTH                  11A CONDO-RENTALS

       tax_class_at_present block   lot easement building_class_at_present  \
199                       4  6244  1001        n                        RK
200                       4  6244  1002        n                        RK
573                       2  2833    31        n                        D4
574                       2  2833    31        n                        D4
575                       2  2833    31        n                        D4
...                     ...   ...   ...      ...                       ...
401843                  nan  5430  1502        n                       nan
402413                  nan  8661  1401        n                       nan
402414                  nan  8661  1402        n                       nan
419658                  nan  2264  3110        n                       nan
420166                  nan  2358  1304        n                       nan

                         address apartment_number             zip_code  \
199         885 ANNADALE ROAD; 1                1            10,312.00
200         885 ANNADALE ROAD; 2                2            10,312.00
573          20 CLIFF STREET; 3B              nan            10,305.00
574          20 CLIFF STREET; 7M              nan            10,305.00
575          20 CLIFF STREET; 8D              nan            10,305.00
...                          ...              ...                  ...
401843          4320 16TH AVENUE                2            11,204.00
402413        2955 OCEAN PARKWAY               BF            11,235.00
402414        2955 OCEAN PARKWAY               BR            11,235.00
419658  242 WALLABOUT STREET; 7A               7A            11,206.00
420166       94 NORTH 3RD STREET              AFF            11,249.00

        residential_units     commercial_units          total_units  \
199                   NaN                 1.00                 1.00
200                   NaN                 1.00                 1.00
573                   NaN                  NaN                  NaN
574                   NaN                  NaN                  NaN
575                   NaN                  NaN                  NaN
...                   ...                  ...                  ...
401843                NaN                  NaN                  NaN
402413                NaN                  NaN                  NaN
402414                NaN                  NaN                  NaN
419658                NaN                  NaN                  NaN
420166                NaN                  NaN                  NaN

        land_square_feet  gross_square_feet           year_built  \
199                  NaN                NaN             1,975.00
200                  NaN                NaN             1,975.00
573                  NaN                NaN             1,964.00
574                  NaN                NaN             1,964.00
575                  NaN                NaN             1,964.00
...                  ...                ...                  ...
401843               NaN                NaN             1,920.00
402413               NaN                NaN             1,938.00
402414               NaN                NaN             1,938.00
419658               NaN                NaN             2,014.00
420166               NaN                NaN             2,017.00

       tax_class_at_time_of_sale building_class_at_time_of_sale  \
199                            4                             RK
200                            4                             RK
573                            2                             D4
574                            2                             D4
575                            2                             D4
...                          ...                            ...
401843                         2                             R1
402413                         2                             R1
402414                         2                             R1
419658                         2                             R4
420166                         2                             RR

                 sale_price  sale_date
199              150,000.00 2022-01-10
200              440,000.00 2022-10-24
573                   10.00 2022-03-17
574                   10.00 2022-07-08
575              249,900.00 2022-11-02
...                     ...        ...
401843           200,000.00 2018-05-30
402413           253,500.00 2018-05-24
402414           294,060.00 2018-05-30
419658           752,894.00 2018-01-07
420166                 0.00 2018-05-15

[76782 rows x 21 columns]

In [328]:
# Get basic descriptive statistics on residential_units
df_p1['residential_units'].describe()

count             352,121.00
mean                    2.65
std                    23.76
min                     0.00
25%                     1.00
50%                     1.00
75%                     2.00
max                 8,764.00
Name: residential_units, dtype: float64

In [329]:
# Check skewness of residential_units
df_p1['residential_units'].skew()

156.56594874472592

As distribution in residential_units is highly skewed and the number of missing values is high (ca. 17% of all rows) and dropping them might delete valuable information in other columns, missing values will be imputed with median.

In [330]:
# Impute missing values in residential_units with median
df_p1['residential_units'].fillna(df_p1['residential_units'].median(), inplace=True)

In [331]:
# Check whether missing values were imputed
df_p1['residential_units'].isna().sum()

0

In [332]:
# Check commercial_units for missing values
df_p1['commercial_units'].isna().sum()

113638

In [333]:
# Inspect some rows with missing values for commercial_units
print(df_p1.loc[df_p1['commercial_units'].isna()])

       borough          neighborhood            building_class_category  \
180          5              ANNADALE              04 TAX CLASS 1 CONDOS
468          5         ARDEN HEIGHTS              04 TAX CLASS 1 CONDOS
469          5         ARDEN HEIGHTS              04 TAX CLASS 1 CONDOS
470          5         ARDEN HEIGHTS              04 TAX CLASS 1 CONDOS
471          5         ARDEN HEIGHTS              04 TAX CLASS 1 CONDOS
...        ...                   ...                                ...
401843       3          BOROUGH PARK  15 CONDOS - 2-10 UNIT RESIDENTIAL
402413       3        BRIGHTON BEACH  15 CONDOS - 2-10 UNIT RESIDENTIAL
402414       3        BRIGHTON BEACH  15 CONDOS - 2-10 UNIT RESIDENTIAL
419658       3  WILLIAMSBURG-CENTRAL    13 CONDOS - ELEVATOR APARTMENTS
420166       3    WILLIAMSBURG-NORTH                  11A CONDO-RENTALS

       tax_class_at_present block   lot easement building_class_at_present  \
180                      1C  6226  1101        n                        R6
468                      1A  6017  1003        n                        R3
469                      1A  6017  1037        n                        R3
470                      1A  6017  1053        n                        R3
471                      1A  6017  1085        n                        R3
...                     ...   ...   ...      ...                       ...
401843                  nan  5430  1502        n                       nan
402413                  nan  8661  1401        n                       nan
402414                  nan  8661  1402        n                       nan
419658                  nan  2264  3110        n                       nan
420166                  nan  2358  1304        n                       nan

                            address apartment_number             zip_code  \
180            736 ANNADALE ROAD; B                B            10,312.00
468           55 ROLLING HILL GREEN              nan            10,312.00
469      60 ROLLING HILL GREEN; N/A              nan            10,312.00
470      96 ROLLING HILL GREEN; N/A              nan            10,312.00
471     221 ROLLING HILL GREEN; N/A              nan            10,312.00
...                             ...              ...                  ...
401843             4320 16TH AVENUE                2            11,204.00
402413           2955 OCEAN PARKWAY               BF            11,235.00
402414           2955 OCEAN PARKWAY               BR            11,235.00
419658     242 WALLABOUT STREET; 7A               7A            11,206.00
420166          94 NORTH 3RD STREET              AFF            11,249.00

          residential_units  commercial_units          total_units  \
180                    1.00               NaN                 1.00
468                    1.00               NaN                 1.00
469                    1.00               NaN                 1.00
470                    1.00               NaN                 1.00
471                    1.00               NaN                 1.00
...                     ...               ...                  ...
401843                 1.00               NaN                  NaN
402413                 1.00               NaN                  NaN
402414                 1.00               NaN                  NaN
419658                 1.00               NaN                  NaN
420166                 1.00               NaN                  NaN

        land_square_feet  gross_square_feet           year_built  \
180                  NaN                NaN             2,012.00
468                  NaN                NaN             1,979.00
469                  NaN                NaN             1,979.00
470                  NaN                NaN             1,979.00
471                  NaN                NaN             1,979.00
...                  ...                ...                  ...
401843               NaN                NaN             1,920.00
402413               NaN                NaN             1,938.00
402414               NaN                NaN             1,938.00
419658               NaN                NaN             2,014.00
420166               NaN                NaN             2,017.00

       tax_class_at_time_of_sale building_class_at_time_of_sale  \
180                            1                             R6
468                            1                             R3
469                            1                             R3
470                            1                             R3
471                            1                             R3
...                          ...                            ...
401843                         2                             R1
402413                         2                             R1
402414                         2                             R1
419658                         2                             R4
420166                         2                             RR

                 sale_price  sale_date
180              810,000.00 2022-01-12
468                    0.00 2022-03-23
469              480,000.00 2022-12-08
470              550,000.00 2022-06-29
471              454,272.00 2022-06-08
...                     ...        ...
401843           200,000.00 2018-05-30
402413           253,500.00 2018-05-24
402414           294,060.00 2018-05-30
419658           752,894.00 2018-01-07
420166                 0.00 2018-05-15

[113638 rows x 21 columns]

In [334]:
# Get basic descriptive statistics on commercial_units
df_p1['commercial_units'].describe()

count             315,265.00
mean                    0.30
std                     7.02
min                     0.00
25%                     0.00
50%                     0.00
75%                     0.00
max                 2,261.00
Name: commercial_units, dtype: float64

In [335]:
# Check skewness of commercial_units
df_p1['commercial_units'].skew()

155.87936242235176

As distribution in residential_units is highly skewed and the number of missing values is high (ca. 26% of all rows) and dropping them might delete valuable information in other columns, missing values will be imputed with median.

In [336]:
# Impute missing values in commercial_units with median
df_p1['commercial_units'].fillna(df_p1['commercial_units'].median(), inplace=True)

In [337]:
# Check whether missing values were imputed
df_p1['commercial_units'].isna().sum()

0

In [338]:
# Check total_units for missing values
df_p1['total_units'].isna().sum()

70762

In [339]:
# Inspect some rows with missing values for total_units
print(df_p1.loc[df_p1['total_units'].isna()])

       borough          neighborhood            building_class_category  \
573          5  ARROCHAR-SHORE ACRES     10 COOPS - ELEVATOR APARTMENTS
574          5  ARROCHAR-SHORE ACRES     10 COOPS - ELEVATOR APARTMENTS
575          5  ARROCHAR-SHORE ACRES     10 COOPS - ELEVATOR APARTMENTS
576          5  ARROCHAR-SHORE ACRES     10 COOPS - ELEVATOR APARTMENTS
577          5  ARROCHAR-SHORE ACRES     10 COOPS - ELEVATOR APARTMENTS
...        ...                   ...                                ...
401843       3          BOROUGH PARK  15 CONDOS - 2-10 UNIT RESIDENTIAL
402413       3        BRIGHTON BEACH  15 CONDOS - 2-10 UNIT RESIDENTIAL
402414       3        BRIGHTON BEACH  15 CONDOS - 2-10 UNIT RESIDENTIAL
419658       3  WILLIAMSBURG-CENTRAL    13 CONDOS - ELEVATOR APARTMENTS
420166       3    WILLIAMSBURG-NORTH                  11A CONDO-RENTALS

       tax_class_at_present block   lot easement building_class_at_present  \
573                       2  2833    31        n                        D4
574                       2  2833    31        n                        D4
575                       2  2833    31        n                        D4
576                       2  2833    31        n                        D4
577                       2  2833    31        n                        D4
...                     ...   ...   ...      ...                       ...
401843                  nan  5430  1502        n                       nan
402413                  nan  8661  1401        n                       nan
402414                  nan  8661  1402        n                       nan
419658                  nan  2264  3110        n                       nan
420166                  nan  2358  1304        n                       nan

                         address apartment_number             zip_code  \
573          20 CLIFF STREET; 3B              nan            10,305.00
574          20 CLIFF STREET; 7M              nan            10,305.00
575          20 CLIFF STREET; 8D              nan            10,305.00
576          20 CLIFF STREET; 8M              nan            10,305.00
577          20 CLIFF STREET; 8N              nan            10,305.00
...                          ...              ...                  ...
401843          4320 16TH AVENUE                2            11,204.00
402413        2955 OCEAN PARKWAY               BF            11,235.00
402414        2955 OCEAN PARKWAY               BR            11,235.00
419658  242 WALLABOUT STREET; 7A               7A            11,206.00
420166       94 NORTH 3RD STREET              AFF            11,249.00

          residential_units     commercial_units  total_units  \
573                    1.00                 0.00          NaN
574                    1.00                 0.00          NaN
575                    1.00                 0.00          NaN
576                    1.00                 0.00          NaN
577                    1.00                 0.00          NaN
...                     ...                  ...          ...
401843                 1.00                 0.00          NaN
402413                 1.00                 0.00          NaN
402414                 1.00                 0.00          NaN
419658                 1.00                 0.00          NaN
420166                 1.00                 0.00          NaN

        land_square_feet  gross_square_feet           year_built  \
573                  NaN                NaN             1,964.00
574                  NaN                NaN             1,964.00
575                  NaN                NaN             1,964.00
576                  NaN                NaN             1,964.00
577                  NaN                NaN             1,964.00
...                  ...                ...                  ...
401843               NaN                NaN             1,920.00
402413               NaN                NaN             1,938.00
402414               NaN                NaN             1,938.00
419658               NaN                NaN             2,014.00
420166               NaN                NaN             2,017.00

       tax_class_at_time_of_sale building_class_at_time_of_sale  \
573                            2                             D4
574                            2                             D4
575                            2                             D4
576                            2                             D4
577                            2                             D4
...                          ...                            ...
401843                         2                             R1
402413                         2                             R1
402414                         2                             R1
419658                         2                             R4
420166                         2                             RR

                 sale_price  sale_date
573                   10.00 2022-03-17
574                   10.00 2022-07-08
575              249,900.00 2022-11-02
576              365,000.00 2022-10-14
577              379,000.00 2022-11-14
...                     ...        ...
401843           200,000.00 2018-05-30
402413           253,500.00 2018-05-24
402414           294,060.00 2018-05-30
419658           752,894.00 2018-01-07
420166                 0.00 2018-05-15

[70762 rows x 21 columns]

Missing values for total_units will be deduced from residential_units + commercial_units.

In [340]:
# Impute missing values in total_units
df_p1['total_units'].fillna((df_p1['residential_units']+df_p1['commercial_units']), inplace=True)

In [341]:
# Check whether missing values were imputed
df_p1['total_units'].isna().sum()

0

In [342]:
# Print row at index 420166 to check whether correct value was imputed (expected value is 1.0)
print(df_p1.iloc[[420166]])

       borough        neighborhood building_class_category  \
420166       3  WILLIAMSBURG-NORTH       11A CONDO-RENTALS

       tax_class_at_present block   lot easement building_class_at_present  \
420166                  nan  2358  1304        n                       nan

                    address apartment_number             zip_code  \
420166  94 NORTH 3RD STREET              AFF            11,249.00

          residential_units     commercial_units          total_units  \
420166                 1.00                 0.00                 1.00

        land_square_feet  gross_square_feet           year_built  \
420166               NaN                NaN             2,017.00

       tax_class_at_time_of_sale building_class_at_time_of_sale  \
420166                         2                             RR

                 sale_price  sale_date
420166                 0.00 2018-05-15

In [343]:
# Check year_built for missing values
df_p1['year_built'].isna().sum()

24025

In [344]:
# Inspect some rows with missing values for year_built
print(df_p1.loc[df_p1['year_built'].isna()])

       borough        neighborhood            building_class_category  \
181          5            ANNADALE         05 TAX CLASS 1 VACANT LAND
184          5            ANNADALE         05 TAX CLASS 1 VACANT LAND
185          5            ANNADALE         05 TAX CLASS 1 VACANT LAND
186          5            ANNADALE         05 TAX CLASS 1 VACANT LAND
188          5            ANNADALE         05 TAX CLASS 1 VACANT LAND
...        ...                 ...                                ...
345025       2      WILLIAMSBRIDGE              29 COMMERCIAL GARAGES
345027       2      WILLIAMSBRIDGE          31 COMMERCIAL VACANT LAND
347874       5         GREAT KILLS            01 ONE FAMILY DWELLINGS
399782       3  BEDFORD STUYVESANT  15 CONDOS - 2-10 UNIT RESIDENTIAL
399783       3  BEDFORD STUYVESANT  15 CONDOS - 2-10 UNIT RESIDENTIAL

       tax_class_at_present block   lot easement building_class_at_present  \
181                      1B  6242    17        n                        V0
184                      1B  6261    56        n                        V0
185                      1B  6266    66        n                        V0
186                      1B  6273    30        n                        V0
188                      1B  6277    96        n                        V0
...                     ...   ...   ...      ...                       ...
345025                    4  4824    25        n                        G7
345027                    4  4667    51        n                        V1
347874                   1B  5511    50        n                        V0
399782                  nan  1803  1002        n                       nan
399783                  nan  1803  1007        n                       nan

                       address apartment_number             zip_code  \
181          N/A MOSELY AVENUE              nan            10,312.00
184       N/A EDGEGROVE AVENUE              nan            10,312.00
185          N/A RENSSELAER AV              nan            10,312.00
186           N/A CROWN AVENUE              nan            10,312.00
188       N/A EDGEGROVE AVENUE              nan            10,312.00
...                        ...              ...                  ...
345025   659 EAST 222ND STREET              nan            10,467.00
345027  3806 WHITE PLAINS ROAD              nan            10,467.00
347874    9 BARTLETT AVENUE; 0              nan            10,312.00
399782    762 MARCY AVENUE; 1B              nan                 0.00
399783     762 MARCY AVENUE; 4              nan                 0.00

          residential_units     commercial_units          total_units  \
181                    0.00                 0.00                 0.00
184                    0.00                 0.00                 0.00
185                    0.00                 0.00                 0.00
186                    0.00                 0.00                 0.00
188                    0.00                 0.00                 0.00
...                     ...                  ...                  ...
345025                 0.00                 0.00                 0.00
345027                 0.00                 0.00                 0.00
347874                 0.00                 0.00                 0.00
399782                 1.00                 0.00                 1.00
399783                 1.00                 0.00                 1.00

           land_square_feet    gross_square_feet  year_built  \
181                5,500.00                 0.00         NaN
184                4,999.00                 0.00         NaN
185                3,920.00                 0.00         NaN
186                5,999.00                 0.00         NaN
188                3,999.00                 0.00         NaN
...                     ...                  ...         ...
345025             2,500.00                 0.00         NaN
345027             2,755.00                 0.00         NaN
347874             4,273.00                 0.00         NaN
399782                  NaN                  NaN         NaN
399783                  NaN                  NaN         NaN

       tax_class_at_time_of_sale building_class_at_time_of_sale  \
181                            1                             V0
184                            1                             V0
185                            1                             V0
186                            1                             V0
188                            1                             V0
...                          ...                            ...
345025                         4                             G7
345027                         4                             V1
347874                         1                             A2
399782                         2                             R1
399783                         2                             R1

                 sale_price  sale_date
181              960,000.00 2022-09-07
184              435,000.00 2022-09-13
185                    0.00 2022-03-16
186                    0.00 2022-06-24
188                    0.00 2022-06-10
...                     ...        ...
345025           375,000.00 2019-08-07
345027                 0.00 2019-07-01
347874           153,295.00 2018-12-27
399782           850,000.00 2018-12-18
399783           875,000.00 2018-12-27

[24025 rows x 21 columns]

In some cases, missing values in year_built could point towards empty land (cf. building class category). However, this does not apply to all rows with missing values, so it is unclear how missing values in year_built can be reasonably imputed. Imputing mean or median does not make sense either in the case of year figures as it is unclear whether they are missing at random or with a pattern. Missing values make up ca. 5,6% of all rows. They will be dropped.

In [345]:
# Drop rows with missing values in year_built
df_p1.dropna(subset=['year_built'], inplace=True)

In [346]:
# Check whether missing values were dropped
df_p1['year_built'].isna().sum()

0

No missing values remain in the columns not converted to integers.

In [347]:
# Convert zip_code to int
df_p1['zip_code'] = df_p1['zip_code'].astype(int, errors='ignore')

# Convert columns on numbers of units to int
df_p1['residential_units'] = df_p1['residential_units'].astype(int, errors='ignore')
df_p1['commercial_units'] = df_p1['commercial_units'].astype(int, errors='ignore')
df_p1['total_units'] = df_p1['total_units'].astype(int, errors='ignore')

# Convert year_built to int
df_p1['year_built'] = df_p1['year_built'].astype(int, errors='ignore')

In [348]:
# Check datatypes in df_p1
df_p1.dtypes

borough                                   object
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                     object
lot                                       object
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                   int64
residential_units                          int64
commercial_units                           int64
total_units                                int64
land_square_feet                         float64
gross_square_feet                        float64
year_built                                 int64
tax_class_at_time_of_sale                 object
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

In [349]:
# Check head of df_p1
df_p1.head()

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,7,n,A5,4732 AMBOY ROAD,nan,10312,1,0,1,"3,654.00",910.00,2002,1,A5,"764,000.00",2022-06-30
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,4,n,A1,26 EDWIN STREET,nan,10312,1,0,1,"7,654.00","2,277.00",1980,1,A1,"1,098,000.00",2022-08-19
2,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,32,n,A1,541 SYCAMORE STREET,nan,10312,1,0,1,"13,320.00","4,696.00",1985,1,A1,0.00,2022-04-20
3,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5399,37,n,A2,255 KOCH BOULEVARD,nan,10312,1,0,1,"8,190.00","1,528.00",1970,1,A2,"890,000.00",2022-01-03
4,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5402,17,n,A2,6 WEAVER STREET,nan,10312,1,0,1,"10,500.00","2,278.00",1980,1,A2,0.00,2022-12-27

## 03.6 Harmonise column datatypes in df_p2

In [350]:
# Recall datatypes in df_p2
df_p2.dtypes

borough                                    int64
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                      int64
lot                                        int64
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                   int64
residential_units                          int64
commercial_units                           int64
total_units                                int64
land_square_feet                         float64
gross_square_feet                        float64
year_built                                 int64
tax_class_at_time_of_sale                  int64
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

In [351]:
# Convert borough, block, lot and tax_class_at_time_of_sale to string
df_p2['borough'] = df_p2['borough'].astype('str')
df_p2['block'] = df_p2['block'].astype('str')
df_p2['lot'] = df_p2['lot'].astype('str')
df_p2['tax_class_at_time_of_sale'] = df_p2['tax_class_at_time_of_sale'].astype('str')

In [352]:
# Check whether conversion has worked
df_p2.dtypes

borough                                   object
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                     object
lot                                       object
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                   int64
residential_units                          int64
commercial_units                           int64
total_units                                int64
land_square_feet                         float64
gross_square_feet                        float64
year_built                                 int64
tax_class_at_time_of_sale                 object
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

## 03.7 Harmonise column datatypes in df_p3

In [353]:
# Recall datatypes in df_p3
df_p3.dtypes

borough                                    int64
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                      int64
lot                                        int64
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                   int64
residential_units                          int64
commercial_units                           int64
total_units                                int64
land_square_feet                         float64
gross_square_feet                        float64
year_built                                 int64
tax_class_at_time_of_sale                  int64
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

In [354]:
# Convert borough, block, lot and tax_class_at_time_of_sale to string
df_p3['borough'] = df_p3['borough'].astype('str')
df_p3['block'] = df_p3['block'].astype('str')
df_p3['lot'] = df_p3['lot'].astype('str')
df_p3['tax_class_at_time_of_sale'] = df_p3['tax_class_at_time_of_sale'].astype('str')

In [355]:
# Check whether conversion has worked
df_p3.dtypes

borough                                   object
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                     object
lot                                       object
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                   int64
residential_units                          int64
commercial_units                           int64
total_units                                int64
land_square_feet                         float64
gross_square_feet                        float64
year_built                                 int64
tax_class_at_time_of_sale                 object
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

## 03.8 Harmonise column datatypes in df_p4

In [356]:
# Recall datatypes in df_p4
df_p4.dtypes

borough                                    int64
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                      int64
lot                                        int64
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                   int64
residential_units                          int64
commercial_units                           int64
total_units                                int64
land_square_feet                         float64
gross_square_feet                        float64
year_built                                 int64
tax_class_at_time_of_sale                  int64
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

In [357]:
# Convert borough, block, lot and tax_class_at_time_of_sale to string
df_p4['borough'] = df_p4['borough'].astype('str')
df_p4['block'] = df_p4['block'].astype('str')
df_p4['lot'] = df_p4['lot'].astype('str')
df_p4['tax_class_at_time_of_sale'] = df_p4['tax_class_at_time_of_sale'].astype('str')

In [358]:
# Check whether conversion has worked
df_p4.dtypes

borough                                   object
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                     object
lot                                       object
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                   int64
residential_units                          int64
commercial_units                           int64
total_units                                int64
land_square_feet                         float64
gross_square_feet                        float64
year_built                                 int64
tax_class_at_time_of_sale                 object
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

## 03.9 Harmonise column datatypes in df_roll

In [359]:
# Recall datatypes in df_roll
df_roll.dtypes

borough                                  float64
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                    float64
lot                                      float64
easement                                 float64
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                 float64
residential_units                        float64
commercial_units                         float64
total_units                              float64
land_square_feet                         float64
gross_square_feet                        float64
year_built                               float64
tax_class_at_time_of_sale                float64
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

In [360]:
# Convert borough, block, lot, easement and tax_class_at_time_of_sale to string
df_roll['borough'] = df_roll['borough'].astype('str').str[:-2]
df_roll['block'] = df_roll['block'].astype('str').str[:-2]
df_roll['lot'] = df_roll['lot'].astype('str').str[:-2]
df_roll['easement'] = df_roll['easement'].astype('str').str[:-2]
df_roll['tax_class_at_time_of_sale'] = df_roll['tax_class_at_time_of_sale'].astype('str').str[:-2]

# Convert zip_code to int
df_roll['zip_code'] = df_roll['zip_code'].astype(int, errors='ignore')

# Convert columns on numbers of units to int
df_roll['residential_units'] = df_roll['residential_units'].astype(int, errors='ignore')
df_roll['commercial_units'] = df_roll['commercial_units'].astype(int, errors='ignore')
df_roll['total_units'] = df_roll['total_units'].astype(int, errors='ignore')

# Convert year_built to int
df_roll['year_built'] = df_roll['year_built'].astype(int, errors='ignore')

In [361]:
# Check whether conversion has worked
df_roll.dtypes

borough                                   object
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                     object
lot                                       object
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                 float64
residential_units                        float64
commercial_units                         float64
total_units                              float64
land_square_feet                         float64
gross_square_feet                        float64
year_built                               float64
tax_class_at_time_of_sale                 object
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

Conversion has not worked for zip_code, residential_units, commercial_units, total_units and year_built.

In [362]:
# Check zip_code for missing values
df_roll['zip_code'].isna().sum()

7

In [363]:
# Inspect rows with missing values for zip_code
print(df_roll.loc[df_roll['zip_code'].isna()])

      borough   neighborhood     building_class_category tax_class_at_present  \
4753        5  OAKWOOD-BEACH  05 TAX CLASS 1 VACANT LAND                   1B
7742        4        ARVERNE       29 COMMERCIAL GARAGES                    4
7743        4        ARVERNE       29 COMMERCIAL GARAGES                    4
75362       3   SPRING CREEK  05 TAX CLASS 1 VACANT LAND                   1B
75363       3   SPRING CREEK  05 TAX CLASS 1 VACANT LAND                   1B
75364       3   SPRING CREEK  05 TAX CLASS 1 VACANT LAND                   1B
75365       3   SPRING CREEK  05 TAX CLASS 1 VACANT LAND                   1B

       block  lot easement building_class_at_present                  address  \
4753    4785    1        n                        V0     N/A PROMENADE AVENUE
7742   16013    1        n                        G7  N/A BEACH CHANNEL DRIVE
7743   16013    1        n                        G7  N/A BEACH CHANNEL DRIVE
75362   4585  165        n                        V0      N/A VANDALIA AVENUE
75363   4585  167        n                        V0      N/A VANDALIA AVENUE
75364   4585  205        n                        V0          N/A DREW STREET
75365   4585  225        n                        V0          N/A DREW STREET

      apartment_number  zip_code    residential_units     commercial_units  \
4753               nan       NaN                 0.00                 0.00
7742               nan       NaN                 0.00                 0.00
7743               nan       NaN                 0.00                 0.00
75362              nan       NaN                 0.00                 0.00
75363              nan       NaN                 0.00                 0.00
75364              nan       NaN                 0.00                 0.00
75365              nan       NaN                 0.00                 0.00

               total_units     land_square_feet    gross_square_feet  \
4753                  0.00            28,980.00                 0.00
7742                  0.00            32,939.00                 0.00
7743                  0.00            32,939.00                 0.00
75362                 0.00            81,867.00                 0.00
75363                 0.00             6,440.00                 0.00
75364                 0.00             1,640.00                 0.00
75365                 0.00             2,582.00                 0.00

       year_built tax_class_at_time_of_sale building_class_at_time_of_sale  \
4753          NaN                         1                             V0
7742          NaN                         4                             G7
7743          NaN                         4                             G7
75362         NaN                         1                             V0
75363         NaN                         1                             V0
75364         NaN                         1                             V0
75365         NaN                         1                             V0

                sale_price  sale_date
4753                  0.00 2022-11-10
7742          4,000,000.00 2022-07-18
7743          5,600,000.00 2023-02-02
75362           163,500.00 2022-10-06
75363           163,500.00 2022-10-06
75364            44,000.00 2022-06-28
75365           163,500.00 2022-10-06

Full address is not available for rows with missing zip code, hence zip code cannot be deduced from address. To remain consistent in handling missing zip_codes, missing values will be imputed as 0 (same approach as for df_p1).

In [364]:
# Imputing 0 for missing values in zip_code
df_roll['zip_code'].fillna(0, inplace=True)

In [365]:
# Check whether missing values were imputed
df_roll['zip_code'].isna().sum()

0

In [366]:
# Check residential_units for missing values
df_roll['residential_units'].isna().sum()

21247

In [367]:
# Inspect some rows with missing values for residential_units
print(df_roll.loc[df_roll['residential_units'].isna()])

      borough          neighborhood         building_class_category  \
174         5              ANNADALE        46 CONDO STORE BUILDINGS
477         5  ARROCHAR-SHORE ACRES  10 COOPS - ELEVATOR APARTMENTS
478         5  ARROCHAR-SHORE ACRES  10 COOPS - ELEVATOR APARTMENTS
479         5  ARROCHAR-SHORE ACRES  10 COOPS - ELEVATOR APARTMENTS
480         5  ARROCHAR-SHORE ACRES  10 COOPS - ELEVATOR APARTMENTS
...       ...                   ...                             ...
84383       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84384       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84385       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84386       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84387       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS

      tax_class_at_present block   lot easement building_class_at_present  \
174                      4  6244  1002        n                        RK
477                      2  2833    31        n                        D4
478                      2  2833    31        n                        D4
479                      2  2833    31        n                        D4
480                      2  2833    31        n                        D4
...                    ...   ...   ...      ...                       ...
84383                    2  3398    97        n                        D4
84384                    2  3398    97        n                        D4
84385                    2  3398    97        n                        D4
84386                    2  3398    97        n                        D4
84387                    2  3398    97        n                        D4

                       address apartment_number             zip_code  \
174       885 ANNADALE ROAD; 2                2            10,312.00
477        20 CLIFF STREET; 3F              nan            10,305.00
478        20 CLIFF STREET; 4N              nan            10,305.00
479       20 CLIFF STREET; 5-O              nan            10,305.00
480        20 CLIFF STREET; 7M              nan            10,305.00
...                        ...              ...                  ...
84383  4295 WEBSTER AVENUE; 4K              nan            10,470.00
84384  4295 WEBSTER AVENUE; 4K              nan            10,470.00
84385  4295 WEBSTER AVENUE; 5C              nan            10,470.00
84386  4295 WEBSTER AVENUE; 6K              nan            10,470.00
84387  4295 WEBSTER AVENUE; L4              nan            10,470.00

       residential_units     commercial_units          total_units  \
174                  NaN                 1.00                 1.00
477                  NaN                  NaN                  NaN
478                  NaN                  NaN                  NaN
479                  NaN                  NaN                  NaN
480                  NaN                  NaN                  NaN
...                  ...                  ...                  ...
84383                NaN                  NaN                  NaN
84384                NaN                  NaN                  NaN
84385                NaN                  NaN                  NaN
84386                NaN                  NaN                  NaN
84387                NaN                  NaN                  NaN

       land_square_feet  gross_square_feet           year_built  \
174                 NaN                NaN             1,975.00
477                 NaN                NaN             1,964.00
478                 NaN                NaN             1,964.00
479                 NaN                NaN             1,964.00
480                 NaN                NaN             1,964.00
...                 ...                ...                  ...
84383               NaN                NaN             1,957.00
84384               NaN                NaN             1,957.00
84385               NaN                NaN             1,957.00
84386               NaN                NaN             1,957.00
84387               NaN                NaN             1,957.00

      tax_class_at_time_of_sale building_class_at_time_of_sale  \
174                           4                             RK
477                           2                             D4
478                           2                             D4
479                           2                             D4
480                           2                             D4
...                         ...                            ...
84383                         2                             D4
84384                         2                             D4
84385                         2                             D4
84386                         2                             D4
84387                         2                             D4

                sale_price  sale_date
174             440,000.00 2022-10-24
477             251,500.00 2023-03-09
478                   0.00 2023-02-17
479             215,000.00 2023-01-25
480                  10.00 2022-07-08
...                    ...        ...
84383           114,500.00 2023-03-01
84384           904,225.00 2022-06-30
84385           904,225.00 2022-06-30
84386           904,225.00 2022-06-30
84387           904,225.00 2022-06-30

[21247 rows x 21 columns]

In [368]:
# Get basic descriptive statistics on residential_units
df_roll['residential_units'].describe()

count              63,144.00
mean                    3.55
std                    25.91
min                     0.00
25%                     1.00
50%                     1.00
75%                     2.00
max                 2,039.00
Name: residential_units, dtype: float64

In [369]:
# Check skewness of residential_units
df_roll['residential_units'].skew()

22.95875394456787

As distribution in residential_units is skewed and the number of missing values is high (ca. 25% of all rows) and dropping them might delete valuable information in other columns, missing values will be imputed with median.

In [370]:
# Impute missing values in residential_units with median
df_roll['residential_units'].fillna(df_roll['residential_units'].median(), inplace=True)

In [371]:
# Check whether missing values were imputed
df_roll['residential_units'].isna().sum()

0

In [372]:
# Check commercial_units for missing values
df_roll['commercial_units'].isna().sum()

37253

In [373]:
# Inspect some rows with missing values for commercial_units
print(df_roll.loc[df_roll['commercial_units'].isna()])

      borough   neighborhood         building_class_category  \
158         5       ANNADALE           04 TAX CLASS 1 CONDOS
395         5  ARDEN HEIGHTS           04 TAX CLASS 1 CONDOS
396         5  ARDEN HEIGHTS           04 TAX CLASS 1 CONDOS
397         5  ARDEN HEIGHTS           04 TAX CLASS 1 CONDOS
398         5  ARDEN HEIGHTS           04 TAX CLASS 1 CONDOS
...       ...            ...                             ...
84383       2       WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84384       2       WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84385       2       WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84386       2       WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84387       2       WOODLAWN  10 COOPS - ELEVATOR APARTMENTS

      tax_class_at_present block   lot easement building_class_at_present  \
158                     1A  6226  1002        n                        R3
395                     1A  5742  1006        n                        R3
396                     1A  6017  1037        n                        R3
397                     1A  6017  1053        n                        R3
398                     1A  6017  1085        n                        R3
...                    ...   ...   ...      ...                       ...
84383                    2  3398    97        n                        D4
84384                    2  3398    97        n                        D4
84385                    2  3398    97        n                        D4
84386                    2  3398    97        n                        D4
84387                    2  3398    97        n                        D4

                           address apartment_number             zip_code  \
158           740 ANNADALE ROAD; B                B            10,312.00
395       400 ASPEN KNOLLS WAY; B3               B3            10,312.00
396     60 ROLLING HILL GREEN; N/A              nan            10,312.00
397     96 ROLLING HILL GREEN; N/A              nan            10,312.00
398    221 ROLLING HILL GREEN; N/A              nan            10,312.00
...                            ...              ...                  ...
84383      4295 WEBSTER AVENUE; 4K              nan            10,470.00
84384      4295 WEBSTER AVENUE; 4K              nan            10,470.00
84385      4295 WEBSTER AVENUE; 5C              nan            10,470.00
84386      4295 WEBSTER AVENUE; 6K              nan            10,470.00
84387      4295 WEBSTER AVENUE; L4              nan            10,470.00

         residential_units  commercial_units          total_units  \
158                   1.00               NaN                 1.00
395                   1.00               NaN                 1.00
396                   1.00               NaN                 1.00
397                   1.00               NaN                 1.00
398                   1.00               NaN                 1.00
...                    ...               ...                  ...
84383                 1.00               NaN                  NaN
84384                 1.00               NaN                  NaN
84385                 1.00               NaN                  NaN
84386                 1.00               NaN                  NaN
84387                 1.00               NaN                  NaN

       land_square_feet  gross_square_feet           year_built  \
158                 NaN                NaN             2,012.00
395                 NaN                NaN             2,010.00
396                 NaN                NaN             1,979.00
397                 NaN                NaN             1,979.00
398                 NaN                NaN             1,979.00
...                 ...                ...                  ...
84383               NaN                NaN             1,957.00
84384               NaN                NaN             1,957.00
84385               NaN                NaN             1,957.00
84386               NaN                NaN             1,957.00
84387               NaN                NaN             1,957.00

      tax_class_at_time_of_sale building_class_at_time_of_sale  \
158                           1                             R3
395                           1                             R3
396                           1                             R3
397                           1                             R3
398                           1                             R3
...                         ...                            ...
84383                         2                             D4
84384                         2                             D4
84385                         2                             D4
84386                         2                             D4
84387                         2                             D4

                sale_price  sale_date
158                   0.00 2023-01-22
395             399,000.00 2023-01-17
396             480,000.00 2022-12-08
397             550,000.00 2022-06-29
398             454,272.00 2022-06-08
...                    ...        ...
84383           114,500.00 2023-03-01
84384           904,225.00 2022-06-30
84385           904,225.00 2022-06-30
84386           904,225.00 2022-06-30
84387           904,225.00 2022-06-30

[37253 rows x 21 columns]

In [374]:
# Get basic descriptive statistics on commercial_units
df_roll['commercial_units'].describe()

count              47,138.00
mean                    0.31
std                     6.51
min                     0.00
25%                     0.00
50%                     0.00
75%                     0.00
max                 1,178.00
Name: commercial_units, dtype: float64

In [375]:
# Check skewness of commercial_units
df_roll['commercial_units'].skew()

137.25283940826756

As distribution in residential_units is highly skewed and the number of missing values is high (ca. 44% of all rows) and dropping them might delete valuable information in other columns, missing values will be imputed with median.

In [376]:
# Impute missing values in commercial_units with median
df_roll['commercial_units'].fillna(df_roll['commercial_units'].median(), inplace=True)

In [377]:
# Check whether missing values were imputed
df_roll['commercial_units'].isna().sum()

0

In [378]:
# Check total_units for missing values
df_roll['total_units'].isna().sum()

18514

In [379]:
# Inspect some rows with missing values for total_units
print(df_roll.loc[df_roll['total_units'].isna()])

      borough          neighborhood         building_class_category  \
477         5  ARROCHAR-SHORE ACRES  10 COOPS - ELEVATOR APARTMENTS
478         5  ARROCHAR-SHORE ACRES  10 COOPS - ELEVATOR APARTMENTS
479         5  ARROCHAR-SHORE ACRES  10 COOPS - ELEVATOR APARTMENTS
480         5  ARROCHAR-SHORE ACRES  10 COOPS - ELEVATOR APARTMENTS
481         5  ARROCHAR-SHORE ACRES  10 COOPS - ELEVATOR APARTMENTS
...       ...                   ...                             ...
84383       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84384       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84385       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84386       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS
84387       2              WOODLAWN  10 COOPS - ELEVATOR APARTMENTS

      tax_class_at_present block lot easement building_class_at_present  \
477                      2  2833  31        n                        D4
478                      2  2833  31        n                        D4
479                      2  2833  31        n                        D4
480                      2  2833  31        n                        D4
481                      2  2833  31        n                        D4
...                    ...   ...  ..      ...                       ...
84383                    2  3398  97        n                        D4
84384                    2  3398  97        n                        D4
84385                    2  3398  97        n                        D4
84386                    2  3398  97        n                        D4
84387                    2  3398  97        n                        D4

                       address apartment_number             zip_code  \
477        20 CLIFF STREET; 3F              nan            10,305.00
478        20 CLIFF STREET; 4N              nan            10,305.00
479       20 CLIFF STREET; 5-O              nan            10,305.00
480        20 CLIFF STREET; 7M              nan            10,305.00
481        20 CLIFF STREET; 8D              nan            10,305.00
...                        ...              ...                  ...
84383  4295 WEBSTER AVENUE; 4K              nan            10,470.00
84384  4295 WEBSTER AVENUE; 4K              nan            10,470.00
84385  4295 WEBSTER AVENUE; 5C              nan            10,470.00
84386  4295 WEBSTER AVENUE; 6K              nan            10,470.00
84387  4295 WEBSTER AVENUE; L4              nan            10,470.00

         residential_units     commercial_units  total_units  \
477                   1.00                 0.00          NaN
478                   1.00                 0.00          NaN
479                   1.00                 0.00          NaN
480                   1.00                 0.00          NaN
481                   1.00                 0.00          NaN
...                    ...                  ...          ...
84383                 1.00                 0.00          NaN
84384                 1.00                 0.00          NaN
84385                 1.00                 0.00          NaN
84386                 1.00                 0.00          NaN
84387                 1.00                 0.00          NaN

       land_square_feet  gross_square_feet           year_built  \
477                 NaN                NaN             1,964.00
478                 NaN                NaN             1,964.00
479                 NaN                NaN             1,964.00
480                 NaN                NaN             1,964.00
481                 NaN                NaN             1,964.00
...                 ...                ...                  ...
84383               NaN                NaN             1,957.00
84384               NaN                NaN             1,957.00
84385               NaN                NaN             1,957.00
84386               NaN                NaN             1,957.00
84387               NaN                NaN             1,957.00

      tax_class_at_time_of_sale building_class_at_time_of_sale  \
477                           2                             D4
478                           2                             D4
479                           2                             D4
480                           2                             D4
481                           2                             D4
...                         ...                            ...
84383                         2                             D4
84384                         2                             D4
84385                         2                             D4
84386                         2                             D4
84387                         2                             D4

                sale_price  sale_date
477             251,500.00 2023-03-09
478                   0.00 2023-02-17
479             215,000.00 2023-01-25
480                  10.00 2022-07-08
481             249,900.00 2022-11-02
...                    ...        ...
84383           114,500.00 2023-03-01
84384           904,225.00 2022-06-30
84385           904,225.00 2022-06-30
84386           904,225.00 2022-06-30
84387           904,225.00 2022-06-30

[18514 rows x 21 columns]

Missing values for total_units will be deduced from residential_units + commercial_units.

In [380]:
# Impute missing values in total_units
df_roll['total_units'].fillna((df_roll['residential_units']+df_roll['commercial_units']), inplace=True)

In [381]:
# Check whether missing values were imputed
df_roll['total_units'].isna().sum()

0

In [382]:
# Print row at index 84387 to check whether correct value was imputed (expected value is 1.0)
print(df_roll.iloc[[84387]])

      borough neighborhood         building_class_category  \
84387       2     WOODLAWN  10 COOPS - ELEVATOR APARTMENTS

      tax_class_at_present block lot easement building_class_at_present  \
84387                    2  3398  97        n                        D4

                       address apartment_number             zip_code  \
84387  4295 WEBSTER AVENUE; L4              nan            10,470.00

         residential_units     commercial_units          total_units  \
84387                 1.00                 0.00                 1.00

       land_square_feet  gross_square_feet           year_built  \
84387               NaN                NaN             1,957.00

      tax_class_at_time_of_sale building_class_at_time_of_sale  \
84387                         2                             D4

                sale_price  sale_date
84387           904,225.00 2022-06-30

In [383]:
# Check year_built for missing values
df_roll['year_built'].isna().sum()

5508

In [384]:
# Inspect some rows with missing values for year_built
print(df_roll.loc[df_roll['year_built'].isna()])

      borough    neighborhood     building_class_category  \
159         5        ANNADALE  05 TAX CLASS 1 VACANT LAND
160         5        ANNADALE  05 TAX CLASS 1 VACANT LAND
162         5        ANNADALE  05 TAX CLASS 1 VACANT LAND
163         5        ANNADALE  05 TAX CLASS 1 VACANT LAND
165         5        ANNADALE  05 TAX CLASS 1 VACANT LAND
...       ...             ...                         ...
84271       2  WILLIAMSBRIDGE       29 COMMERCIAL GARAGES
84272       2  WILLIAMSBRIDGE       29 COMMERCIAL GARAGES
84274       2  WILLIAMSBRIDGE   31 COMMERCIAL VACANT LAND
84275       2  WILLIAMSBRIDGE   31 COMMERCIAL VACANT LAND
84340       2        WOODLAWN  05 TAX CLASS 1 VACANT LAND

      tax_class_at_present block lot easement building_class_at_present  \
159                     1B  6209  29        n                        V0
160                     1B  6242  17        n                        V0
162                     1B  6261  56        n                        V0
163                     1B  6273  30        n                        V0
165                     1B  6277  96        n                        V0
...                    ...   ...  ..      ...                       ...
84271                    4  4664  34        n                        G7
84272                    4  4825  12        n                        G7
84274                    4  4647  67        n                        V1
84275                    4  4831  11        n                        V1
84340                   1B  3378   5        n                        V0

                           address apartment_number             zip_code  \
159              N/A MOSELY AVENUE              nan            10,312.00
160              N/A MOSELY AVENUE              nan            10,312.00
162           N/A EDGEGROVE AVENUE              nan            10,312.00
163               N/A CROWN AVENUE              nan            10,312.00
165           N/A EDGEGROVE AVENUE              nan            10,312.00
...                            ...              ...                  ...
84271            727 EAST 216TH ST              nan            10,467.00
84272          689 EAST 223 STREET              nan            10,466.00
84274        N/A WHITE PLAINS ROAD              nan            10,467.00
84275  4051-4057 WHITE PLAINS ROAD              nan            10,466.00
84340              4316 KEPLER AVE              nan            10,470.00

         residential_units     commercial_units          total_units  \
159                   0.00                 0.00                 0.00
160                   0.00                 0.00                 0.00
162                   0.00                 0.00                 0.00
163                   0.00                 0.00                 0.00
165                   0.00                 0.00                 0.00
...                    ...                  ...                  ...
84271                 0.00                 0.00                 0.00
84272                 0.00                 0.00                 0.00
84274                 0.00                 0.00                 0.00
84275                 0.00                 0.00                 0.00
84340                 0.00                 0.00                 0.00

          land_square_feet    gross_square_feet  year_built  \
159              36,440.00                 0.00         NaN
160               5,500.00                 0.00         NaN
162               5,000.00                 0.00         NaN
163               6,000.00                 0.00         NaN
165               4,000.00                 0.00         NaN
...                    ...                  ...         ...
84271             2,854.00                 0.00         NaN
84272             2,856.00                 0.00         NaN
84274                66.00                 0.00         NaN
84275             5,625.00                 0.00         NaN
84340             2,200.00                 0.00         NaN

      tax_class_at_time_of_sale building_class_at_time_of_sale  \
159                           1                             V0
160                           1                             V0
162                           1                             V0
163                           1                             V0
165                           1                             V0
...                         ...                            ...
84271                         4                             G7
84272                         4                             G7
84274                         4                             V1
84275                         4                             V1
84340                         1                             V0

                sale_price  sale_date
159              50,000.00 2023-01-17
160             960,000.00 2022-09-07
162             435,000.00 2022-09-13
163                   0.00 2022-06-24
165                   0.00 2022-06-10
...                    ...        ...
84271           710,000.00 2022-08-31
84272         2,000,000.00 2022-06-16
84274         7,500,000.00 2022-10-18
84275         1,000,000.00 2022-11-02
84340                 0.00 2022-04-29

[5508 rows x 21 columns]

To remain consistent with handling missing values in df_p1, rows with missing values for year_built will be dropped (ca. 6,5% of all rows).

In [385]:
# Drop rows with missing values in year_built
df_roll.dropna(subset=['year_built'], inplace=True)

In [386]:
# Check whether missing values were dropped
df_roll['year_built'].isna().sum()

0

No missing values remain in the columns not converted to integers.

In [387]:
# Convert zip_code to int
df_roll['zip_code'] = df_roll['zip_code'].astype(int, errors='ignore')

# Convert columns on numbers of units to int
df_roll['residential_units'] = df_roll['residential_units'].astype(int, errors='ignore')
df_roll['commercial_units'] = df_roll['commercial_units'].astype(int, errors='ignore')
df_roll['total_units'] = df_roll['total_units'].astype(int, errors='ignore')

# Convert year_built to int
df_roll['year_built'] = df_roll['year_built'].astype(int, errors='ignore')

In [388]:
# Check datatypes in df_roll
df_roll.dtypes

borough                                   object
neighborhood                              object
building_class_category                   object
tax_class_at_present                      object
block                                     object
lot                                       object
easement                                  object
building_class_at_present                 object
address                                   object
apartment_number                          object
zip_code                                   int64
residential_units                          int64
commercial_units                           int64
total_units                                int64
land_square_feet                         float64
gross_square_feet                        float64
year_built                                 int64
tax_class_at_time_of_sale                 object
building_class_at_time_of_sale            object
sale_price                               float64
sale_date                         datetime64[ns]
dtype: object

In [389]:
# Check head of df_roll
df_roll.head()

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,7,n,A5,4732 AMBOY ROAD,nan,10312,1,0,1,"3,655.00",910.00,2002,1,A5,"764,000.00",2022-06-30
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,4,n,A1,26 EDWIN STREET,nan,10312,1,0,1,"7,654.00","2,277.00",1980,1,A1,"1,098,000.00",2022-08-19
2,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,32,n,A1,541 SYCAMORE STREET,nan,10312,1,0,1,"13,320.00","4,696.00",1985,1,A1,0.00,2022-04-20
3,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5396,41,n,A1,21 TALLMAN STREET,nan,10312,1,0,1,"9,968.00","3,940.00",1990,1,A1,"1,275,000.00",2023-03-17
4,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5401,42,n,A2,265 HAROLD AVENUE,nan,10312,1,0,1,"8,190.00","2,100.00",1980,1,A2,"385,000.00",2023-02-16

# 04 Final check for mixed-type columns before merging

In [390]:
# Check again for mixed-type columns in df_p1
for col in df_p1.columns.tolist():
  weird = (df_p1[[col]].applymap(type) != df_p1[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_p1[weird]) > 0:
    print (col)

In [391]:
# Check again for mixed-type columns in df_p2
for col in df_p2.columns.tolist():
  weird = (df_p2[[col]].applymap(type) != df_p2[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_p2[weird]) > 0:
    print (col)

In [392]:
# Check again for mixed-type columns in df_p3
for col in df_p3.columns.tolist():
  weird = (df_p3[[col]].applymap(type) != df_p3[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_p3[weird]) > 0:
    print (col)

In [393]:
# Check again for mixed-type columns in df_p4
for col in df_p4.columns.tolist():
  weird = (df_p4[[col]].applymap(type) != df_p4[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_p4[weird]) > 0:
    print (col)

In [394]:
# Check again for mixed-type columns in df_roll
for col in df_roll.columns.tolist():
  weird = (df_roll[[col]].applymap(type) != df_roll[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_roll[weird]) > 0:
    print (col)

# 05 Merging all dataframes into one

In [395]:
# Create list of dataframes
list_dfs = [df_p1, df_p2, df_p3, df_p4, df_roll]

# Concatenate dataframes
df = pd.concat(list_dfs, ignore_index=True)

In [396]:
# Check head of df
df.head()

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,7,n,A5,4732 AMBOY ROAD,nan,10312,1,0,1,"3,654.00",910.00,2002,1,A5,"764,000.00",2022-06-30
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,4,n,A1,26 EDWIN STREET,nan,10312,1,0,1,"7,654.00","2,277.00",1980,1,A1,"1,098,000.00",2022-08-19
2,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,32,n,A1,541 SYCAMORE STREET,nan,10312,1,0,1,"13,320.00","4,696.00",1985,1,A1,0.00,2022-04-20
3,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5399,37,n,A2,255 KOCH BOULEVARD,nan,10312,1,0,1,"8,190.00","1,528.00",1970,1,A2,"890,000.00",2022-01-03
4,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5402,17,n,A2,6 WEAVER STREET,nan,10312,1,0,1,"10,500.00","2,278.00",1980,1,A2,0.00,2022-12-27

In [397]:
# Get info on df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1916261 entries, 0 to 1916260
Data columns (total 21 columns):
 #   Column                          Dtype
---  ------                          -----
 0   borough                         object
 1   neighborhood                    object
 2   building_class_category         object
 3   tax_class_at_present            object
 4   block                           object
 5   lot                             object
 6   easement                        object
 7   building_class_at_present       object
 8   address                         object
 9   apartment_number                object
 10  zip_code                        int64
 11  residential_units               int64
 12  commercial_units                int64
 13  total_units                     int64
 14  land_square_feet                float64
 15  gross_square_feet               float64
 16  year_built                      int64
 17  tax_class_at_time_of_sale       object
 18  building_class_at_time_of_sale  object
 19  sale_price                      float64
 20  sale_date                       datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(5), object(12)
memory usage: 307.0+ MB

In [398]:
# Double-check whether concatenation worked
len(df) == len(df_p1) + len(df_p2) + len(df_p3) + len(df_p4) + len(df_roll)

True

In [399]:
# Double-check for mixed-type columns in df
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

# 06 Data cleaning - merged dataframe

## 06.1 Address duplicates

In [400]:
# Check for duplicates
df_dups = df[df.duplicated()]

In [401]:
# Check size of df_dups
df_dups.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 78621 entries, 243301 to 1916260
Data columns (total 21 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   borough                         78621 non-null  object
 1   neighborhood                    78621 non-null  object
 2   building_class_category         78621 non-null  object
 3   tax_class_at_present            78621 non-null  object
 4   block                           78621 non-null  object
 5   lot                             78621 non-null  object
 6   easement                        78621 non-null  object
 7   building_class_at_present       78621 non-null  object
 8   address                         78621 non-null  object
 9   apartment_number                78621 non-null  object
 10  zip_code                        78621 non-null  int64
 11  residential_units               78621 non-null  int64
 12  commercial_units                78621 non-null  int64
 13  total_units                     78621 non-null  int64
 14  land_square_feet                49210 non-null  float64
 15  gross_square_feet               49210 non-null  float64
 16  year_built                      78621 non-null  int64
 17  tax_class_at_time_of_sale       78621 non-null  object
 18  building_class_at_time_of_sale  78621 non-null  object
 19  sale_price                      78621 non-null  float64
 20  sale_date                       78621 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(5), object(12)
memory usage: 13.2+ MB

There are 78621 full duplicates in the dataframe which can be dropped.

In [402]:
# Drop full duplicates from df_no_dups
df_no_dups = df.drop_duplicates()

In [403]:
# Check for accuracy of dropping duplicates
len(df) == len(df_dups) + len(df_no_dups)

True

In [404]:
# Get info on df_no_dups
df_no_dups.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1837640 entries, 0 to 1916259
Data columns (total 21 columns):
 #   Column                          Dtype
---  ------                          -----
 0   borough                         object
 1   neighborhood                    object
 2   building_class_category         object
 3   tax_class_at_present            object
 4   block                           object
 5   lot                             object
 6   easement                        object
 7   building_class_at_present       object
 8   address                         object
 9   apartment_number                object
 10  zip_code                        int64
 11  residential_units               int64
 12  commercial_units                int64
 13  total_units                     int64
 14  land_square_feet                float64
 15  gross_square_feet               float64
 16  year_built                      int64
 17  tax_class_at_time_of_sale       object
 18  building_class_at_time_of_sale  object
 19  sale_price                      float64
 20  sale_date                       datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(5), object(12)
memory usage: 308.4+ MB

## 06.2 Check for missing values

In [405]:
df_no_dups['borough'].isna().sum()

0

In [406]:
df_no_dups['neighborhood'].isna().sum()

0

In [407]:
df_no_dups['building_class_category'].isna().sum()

0

In [408]:
df_no_dups['tax_class_at_present'].isna().sum()

0

In [409]:
df_no_dups['block'].isna().sum()

0

In [410]:
df_no_dups['lot'].isna().sum()

0

In [411]:
df_no_dups['easement'].isna().sum()

0

In [412]:
df_no_dups['building_class_at_present'].isna().sum()

0

In [413]:
df_no_dups['address'].isna().sum()

0

In [414]:
df_no_dups['apartment_number'].isna().sum()

0

In [415]:
df_no_dups['zip_code'].isna().sum()

0

In [416]:
df_no_dups['year_built'].isna().sum()

0

In [417]:
df_no_dups['tax_class_at_time_of_sale'].isna().sum()

0

In [418]:
df_no_dups['building_class_at_time_of_sale'].isna().sum()

0

In [419]:
df_no_dups['sale_date'].isna().sum()

0

In [420]:
df_no_dups['residential_units'].isna().sum()

0

In [421]:
df_no_dups['commercial_units'].isna().sum()

0

In [422]:
df_no_dups['total_units'].isna().sum()

0

In [423]:
df_no_dups['land_square_feet'].isna().sum()

116061

In [424]:
df_no_dups['gross_square_feet'].isna().sum()

116060

In [425]:
df_no_dups['sale_price'].isna().sum()

0

In [426]:
df_no_dups['sale_date'].isna().sum()

0

## 06.3 Get descriptive statistics for columns with missing values

In [427]:
# Descriptive statistics for land_square_feet
df_no_dups['land_square_feet'].describe()

count           1,721,579.00
mean                3,694.01
std               291,427.74
min                     0.00
25%                     0.00
50%                 1,975.00
75%                 2,900.00
max           214,755,710.00
Name: land_square_feet, dtype: float64

In [428]:
# Get skew for land_square_feet
df_no_dups['land_square_feet'].skew()

699.5853671838145

In [429]:
# Descriptive statistics for gross_square_feet
df_no_dups['gross_square_feet'].describe()

count           1,721,580.00
mean                4,053.04
std                41,801.49
min                     0.00
25%                     0.00
50%                 1,346.00
75%                 2,400.00
max            14,962,152.00
Name: gross_square_feet, dtype: float64

In [430]:
# Get skew for gross_square_feet
df['gross_square_feet'].skew()

152.70894903047784

## 06.7 Create subsets with missing values

In [431]:
# Create subsets
df_nan_land_square = df_no_dups[df_no_dups['land_square_feet'].isna() == True]
df_nan_gross_square = df_no_dups[df_no_dups['gross_square_feet'].isna() == True]

In [432]:
# Inspect head of subset I
df_nan_land_square.head()

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
180,5,ANNADALE,04 TAX CLASS 1 CONDOS,1C,6226,1101,n,R6,736 ANNADALE ROAD; B,B,10312,1,0,1,NaN,NaN,2012,1,R6,"810,000.00",2022-01-12
185,5,ANNADALE,46 CONDO STORE BUILDINGS,4,6244,1001,n,RK,885 ANNADALE ROAD; 1,1,10312,1,1,1,NaN,NaN,1975,4,RK,"150,000.00",2022-01-10
186,5,ANNADALE,46 CONDO STORE BUILDINGS,4,6244,1002,n,RK,885 ANNADALE ROAD; 2,2,10312,1,1,1,NaN,NaN,1975,4,RK,"440,000.00",2022-10-24
454,5,ARDEN HEIGHTS,04 TAX CLASS 1 CONDOS,1A,6017,1003,n,R3,55 ROLLING HILL GREEN,nan,10312,1,0,1,NaN,NaN,1979,1,R3,0.00,2022-03-23
455,5,ARDEN HEIGHTS,04 TAX CLASS 1 CONDOS,1A,6017,1037,n,R3,60 ROLLING HILL GREEN; N/A,nan,10312,1,0,1,NaN,NaN,1979,1,R3,"480,000.00",2022-12-08

In [433]:
# Inspect head of subset II
df_nan_gross_square.head()

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
180,5,ANNADALE,04 TAX CLASS 1 CONDOS,1C,6226,1101,n,R6,736 ANNADALE ROAD; B,B,10312,1,0,1,NaN,NaN,2012,1,R6,"810,000.00",2022-01-12
185,5,ANNADALE,46 CONDO STORE BUILDINGS,4,6244,1001,n,RK,885 ANNADALE ROAD; 1,1,10312,1,1,1,NaN,NaN,1975,4,RK,"150,000.00",2022-01-10
186,5,ANNADALE,46 CONDO STORE BUILDINGS,4,6244,1002,n,RK,885 ANNADALE ROAD; 2,2,10312,1,1,1,NaN,NaN,1975,4,RK,"440,000.00",2022-10-24
454,5,ARDEN HEIGHTS,04 TAX CLASS 1 CONDOS,1A,6017,1003,n,R3,55 ROLLING HILL GREEN,nan,10312,1,0,1,NaN,NaN,1979,1,R3,0.00,2022-03-23
455,5,ARDEN HEIGHTS,04 TAX CLASS 1 CONDOS,1A,6017,1037,n,R3,60 ROLLING HILL GREEN; N/A,nan,10312,1,0,1,NaN,NaN,1979,1,R3,"480,000.00",2022-12-08

In [434]:
# Inspect tail of subset I
df_nan_land_square.tail()

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
1916221,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3368,10,n,D4,4320 VAN CORTLANDT PARK EAST; 4G,nan,10470,1,0,1,NaN,NaN,1958,2,D4,"155,000.00",2023-03-03
1916225,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3368,10,n,D4,4320 VAN CORTLANDT PARK EAST; 6N,nan,10470,1,0,1,NaN,NaN,1958,2,D4,"195,000.00",2023-02-15
1916243,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3398,87,n,D4,4315 WEBSTER AVE; 6M,nan,10470,1,0,1,NaN,NaN,1958,2,D4,"220,000.00",2023-03-09
1916245,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3398,97,n,D4,4295 WEBSTER AVE; 2F,nan,10470,1,0,1,NaN,NaN,1957,2,D4,"250,000.00",2023-02-02
1916253,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3398,97,n,D4,4295 WEBSTER AVENUE; 4K,nan,10470,1,0,1,NaN,NaN,1957,2,D4,"114,500.00",2023-03-01

In [435]:
# Inspect tail of subset II
df_nan_gross_square.tail()

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
1916221,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3368,10,n,D4,4320 VAN CORTLANDT PARK EAST; 4G,nan,10470,1,0,1,NaN,NaN,1958,2,D4,"155,000.00",2023-03-03
1916225,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3368,10,n,D4,4320 VAN CORTLANDT PARK EAST; 6N,nan,10470,1,0,1,NaN,NaN,1958,2,D4,"195,000.00",2023-02-15
1916243,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3398,87,n,D4,4315 WEBSTER AVE; 6M,nan,10470,1,0,1,NaN,NaN,1958,2,D4,"220,000.00",2023-03-09
1916245,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3398,97,n,D4,4295 WEBSTER AVE; 2F,nan,10470,1,0,1,NaN,NaN,1957,2,D4,"250,000.00",2023-02-02
1916253,2,WOODLAWN,10 COOPS - ELEVATOR APARTMENTS,2,3398,97,n,D4,4295 WEBSTER AVENUE; 4K,nan,10470,1,0,1,NaN,NaN,1957,2,D4,"114,500.00",2023-03-01

Rows with missing land and gross square feet are kept as some other columns in those rows contain valuable information. Missing values in land and gross square feet will be imputed with median as both have a highly skewed distribution.

## 06.8 Address missing values

In [436]:
# Impute missing values in land_square_feet with median
df_no_dups['land_square_feet'].fillna(df_no_dups['land_square_feet'].median(), inplace=True)

/var/folders/xf/prw7mx913rn2xzxlywvr1_jc0000gn/T/ipykernel_44932/3852708212.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_dups['land_square_feet'].fillna(df_no_dups['land_square_feet'].median(), inplace=True)

In [437]:
# Impute missing values in gross_square_feet with median
df_no_dups['gross_square_feet'].fillna(df_no_dups['gross_square_feet'].median(), inplace=True)

/var/folders/xf/prw7mx913rn2xzxlywvr1_jc0000gn/T/ipykernel_44932/3253382794.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_dups['gross_square_feet'].fillna(df_no_dups['gross_square_feet'].median(), inplace=True)

### Check whether missing values were filled

In [438]:
df_no_dups['land_square_feet'].isna().sum()

0

In [439]:
df_no_dups['gross_square_feet'].isna().sum()

0

# 07 Creating flags

## 07.1 Sale prices == 0

Cf. information from the NYC Department of Finance:

A 0 dollar sale price indicates that there was a transfer of ownership without a cash consideration. There can be a number of reasons for a 0 dollar sale_price including transfers of ownership from parents to children.

In [440]:
# Flag sale prices that are 0
df_no_dups.loc[df_no_dups['sale_price'] == 0, 'sale_price_flag'] = 'transf_ownership'

/var/folders/xf/prw7mx913rn2xzxlywvr1_jc0000gn/T/ipykernel_44932/2928222934.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_no_dups.loc[df_no_dups['sale_price'] == 0, 'sale_price_flag'] = 'transf_ownership'

In [441]:
# Check creation of flag column
df_no_dups.head(3)

,borough,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date,sale_price_flag
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,7,n,A5,4732 AMBOY ROAD,nan,10312,1,0,1,"3,654.00",910.00,2002,1,A5,"764,000.00",2022-06-30,NaN
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,4,n,A1,26 EDWIN STREET,nan,10312,1,0,1,"7,654.00","2,277.00",1980,1,A1,"1,098,000.00",2022-08-19,NaN
2,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,32,n,A1,541 SYCAMORE STREET,nan,10312,1,0,1,"13,320.00","4,696.00",1985,1,A1,0.00,2022-04-20,transf_ownership

In [442]:
# Check correct creation of flag
(df_no_dups[df_no_dups['sale_price'] == 0].value_counts().sum()) == (df_no_dups[df_no_dups['sale_price_flag'] == 'transf_ownership'].value_counts().sum())

True

## 07.2 Imputing borough names

In [443]:
# Rename column borough
df_no_dups = df_no_dups.rename(columns={'borough': 'borough_code'})

In [444]:
# Check renaming
df_no_dups.head(2)

,borough_code,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date,sale_price_flag
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,7,n,A5,4732 AMBOY ROAD,nan,10312,1,0,1,"3,654.00",910.00,2002,1,A5,"764,000.00",2022-06-30,NaN
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,4,n,A1,26 EDWIN STREET,nan,10312,1,0,1,"7,654.00","2,277.00",1980,1,A1,"1,098,000.00",2022-08-19,NaN

In [445]:
# Create column with borough name
df_no_dups.loc[df_no_dups['borough_code'] == '1', 'borough_name'] = 'Manhattan'
df_no_dups.loc[df_no_dups['borough_code'] == '2', 'borough_name'] = 'Bronx'
df_no_dups.loc[df_no_dups['borough_code'] == '3', 'borough_name'] = 'Brooklyn'
df_no_dups.loc[df_no_dups['borough_code'] == '4', 'borough_name'] = 'Queens'
df_no_dups.loc[df_no_dups['borough_code'] == '5', 'borough_name'] = 'Staten Island'

In [446]:
# Check creation of borough name column
df_no_dups.head(3)

,borough_code,neighborhood,building_class_category,tax_class_at_present,block,lot,easement,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date,sale_price_flag,borough_name
0,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5391,7,n,A5,4732 AMBOY ROAD,nan,10312,1,0,1,"3,654.00",910.00,2002,1,A5,"764,000.00",2022-06-30,NaN,Staten Island
1,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,4,n,A1,26 EDWIN STREET,nan,10312,1,0,1,"7,654.00","2,277.00",1980,1,A1,"1,098,000.00",2022-08-19,NaN,Staten Island
2,5,ANNADALE,01 ONE FAMILY DWELLINGS,1,5395,32,n,A1,541 SYCAMORE STREET,nan,10312,1,0,1,"13,320.00","4,696.00",1985,1,A1,0.00,2022-04-20,transf_ownership,Staten Island

In [447]:
# Check correct creation of borogh name column for Manhattan
(df_no_dups[df_no_dups['borough_code'] == '1'].value_counts().sum()) == (df_no_dups[df_no_dups['borough_name'] == 'Manhattan'].value_counts().sum())

True

In [448]:
# Check correct creation of borogh name column for Bronx
(df_no_dups[df_no_dups['borough_code'] == '2'].value_counts().sum()) == (df_no_dups[df_no_dups['borough_name'] == 'Bronx'].value_counts().sum())

True

In [449]:
# Check correct creation of borogh name column for Brooklyn
(df_no_dups[df_no_dups['borough_code'] == '3'].value_counts().sum()) == (df_no_dups[df_no_dups['borough_name'] == 'Brooklyn'].value_counts().sum())

True

In [450]:
# Check correct creation of borogh name column for Queens
(df_no_dups[df_no_dups['borough_code'] == '4'].value_counts().sum()) == (df_no_dups[df_no_dups['borough_name'] == 'Queens'].value_counts().sum())

True

In [451]:
# Check correct creation of borogh name column for Staten Island
(df_no_dups[df_no_dups['borough_code'] == '5'].value_counts().sum()) == (df_no_dups[df_no_dups['borough_name'] == 'Staten Island'].value_counts().sum())

True

In [452]:
# Check for NaN in borough name
df_no_dups['borough_name'].isna().sum()

0

In [453]:
# Double-check for mixed-type columns in df_no_dups
for col in df_no_dups.columns.tolist():
  weird = (df_no_dups[[col]].applymap(type) != df_no_dups[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_no_dups[weird]) > 0:
    print (col)

sale_price_flag

In [454]:
# Convert sale_price_flag to str
df_no_dups['sale_price_flag'] = df_no_dups['sale_price_flag'].astype('str')

In [455]:
# Double-check for mixed-type columns in df_no_dups again
for col in df_no_dups.columns.tolist():
  weird = (df_no_dups[[col]].applymap(type) != df_no_dups[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_no_dups[weird]) > 0:
    print (col)

In [456]:
df_no_dups.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1837640 entries, 0 to 1916259
Data columns (total 23 columns):
 #   Column                          Dtype
---  ------                          -----
 0   borough_code                    object
 1   neighborhood                    object
 2   building_class_category         object
 3   tax_class_at_present            object
 4   block                           object
 5   lot                             object
 6   easement                        object
 7   building_class_at_present       object
 8   address                         object
 9   apartment_number                object
 10  zip_code                        int64
 11  residential_units               int64
 12  commercial_units                int64
 13  total_units                     int64
 14  land_square_feet                float64
 15  gross_square_feet               float64
 16  year_built                      int64
 17  tax_class_at_time_of_sale       object
 18  building_class_at_time_of_sale  object
 19  sale_price                      float64
 20  sale_date                       datetime64[ns]
 21  sale_price_flag                 object
 22  borough_name                    object
dtypes: datetime64[ns](1), float64(3), int64(5), object(14)
memory usage: 336.5+ MB

# 08 Data consistency checks

In [457]:
# Unique values in borough_code
df_no_dups['borough_code'].value_counts(dropna=False)

4    573572
3    514912
1    427278
5    170192
2    151686
Name: borough_code, dtype: int64

In [458]:
# Unique values in neighborhood
df_no_dups['neighborhood'].value_counts(dropna=False)

MIDTOWN WEST                 51353
FLUSHING-NORTH               38662
UPPER EAST SIDE (59-79)      29724
UPPER WEST SIDE (59-79)      27378
BEDFORD STUYVESANT           25908
                             ...
EAST RIVER                       2
PELHAM BAY                       2
3004                             2
3019                             1
1021                             1
Name: neighborhood, Length: 516, dtype: int64

In [459]:
# Unique values in building_class_category
df_no_dups['building_class_category'].value_counts(dropna=False)

01  ONE FAMILY HOMES                            207756
02  TWO FAMILY HOMES                            192213
10  COOPS - ELEVATOR APARTMENTS                 192181
13  CONDOS - ELEVATOR APARTMENTS                177206
01 ONE FAMILY DWELLINGS                         105143
                                                 ...
40 SELECTED GOVERNMENTAL FACILITIES                  5
39 TRANSPORTATION FACILITIES                         4
40 SELECTED GOVERNMENTAL FACILITIES                  3
39 TRANSPORTATION FACILITIES                         3
11 SPECIAL CONDO BILLING LOTS                        1
Name: building_class_category, Length: 145, dtype: int64

In [460]:
# Unique values in tax_class_at_present
df_no_dups['tax_class_at_present'].value_counts(dropna=False)

1      862920
2      635885
4      155892
2A      56813
2C      36147
1A      29433
2B      18948
1B      18620
        17004
1C       2567
         1979
1D        922
nan       391
3         119
Name: tax_class_at_present, dtype: int64

In [461]:
# Unique values in block
df_no_dups['block'].value_counts(dropna=False)

1027     17823
1009     10515
1006      8523
1171      5967
16        4904
         ...
16006        1
16330        1
9364         1
7068         1
4279         1
Name: block, Length: 13628, dtype: int64

In [462]:
# Unique values in lot
df_no_dups['lot'].value_counts(dropna=False)

1       84687
37      26652
20      21060
12      21037
23      21002
        ...
5774        1
5129        1
6103        1
6117        1
4963        1
Name: lot, Length: 5888, dtype: int64

In [463]:
# Unique values in easement
df_no_dups['easement'].value_counts(dropna=False)

     1404644
n     432983
E         13
Name: easement, dtype: int64

In [464]:
# Unique values in building_class_at_present
df_no_dups['building_class_at_present'].value_counts(dropna=False)

D4    269286
R4    244721
A1    149540
A5    121576
B2    111693
       ...
P4         2
Y7         2
I2         2
CM         1
U5         1
Name: building_class_at_present, Length: 216, dtype: int64

In [465]:
# Unique values in address
df_no_dups['address'].value_counts(dropna=False)

870 7 AVENUE                                 13510
102 WEST 57TH STREET                          7496
1335 AVENUE OF THE AMERIC                     3431
200 WEST 56TH   STREET                        2705
1335 6 AVENUE                                 2699
                                             ...
80-51 233 STREET                                 1
80-34 235TH   STREET                             1
236-07 SEWARD AVE                                1
234-08 SEWARD AVENUE                             1
4295 WEBSTER AVE; 2F                             1
Name: address, Length: 1206966, dtype: int64

In [466]:
# Unique values in apartment_number
df_no_dups['apartment_number'].value_counts(dropna=False)

                1031279
nan              345595
                  69440
TIMES              6614
4                  5351
                 ...
36 B                  1
PH-AS                 1
28 B                  1
3RS                   1
913A                  1
Name: apartment_number, Length: 29370, dtype: int64

In [467]:
# Unique values in zip_code
df_no_dups['zip_code'].value_counts(dropna=False)

10019    54970
10314    30459
10023    28267
11234    24841
11375    24498
         ...
10281        1
11452        1
11359        1
11315        1
10436        1
Name: zip_code, Length: 248, dtype: int64

In [468]:
# Unique values in year_built
df_no_dups['year_built'].value_counts(dropna=False)

0       171904
1920    138609
1930    113022
1925     98003
1910     77412
         ...
220          1
1821         1
1867         1
1802         1
1648         1
Name: year_built, Length: 214, dtype: int64

In [469]:
# Unique values in tax_class_at_time_of_sale
df_no_dups['tax_class_at_time_of_sale'].value_counts(dropna=False)

1    922697
2    752320
4    162464
3       159
Name: tax_class_at_time_of_sale, dtype: int64

In [470]:
# Unique values in building_class_at_time_of_sale
df_no_dups['building_class_at_time_of_sale'].value_counts(dropna=False)

D4    269559
R4    247787
A1    151673
A5    121398
B2    110206
       ...
Y7         2
N3         2
CM         1
Y9         1
Y5         1
Name: building_class_at_time_of_sale, Length: 215, dtype: int64

In [471]:
# Unique values in sale_date
df_no_dups['sale_date'].value_counts(dropna=False)

2006-08-31    1629
2003-02-20    1203
2008-10-02     991
2012-09-27     980
2004-06-30     880
              ...
2020-04-19       1
2016-11-27       1
2017-06-04       1
2019-10-13       1
2020-07-05       1
Name: sale_date, Length: 7393, dtype: int64

In [472]:
# Unique values in residential_units
df_no_dups['residential_units'].value_counts(dropna=False)

1       788788
0       464203
2       370056
3       109541
4        29907
         ...
550          1
399          1
1328         1
635          1
2039         1
Name: residential_units, Length: 520, dtype: int64

In [473]:
# Unique values in commercial_units
df_no_dups['commercial_units'].value_counts(dropna=False)

0      1664927
1       127399
2        26771
3         6327
4         3383
        ...
153          1
730          1
80           1
92           1
390          1
Name: commercial_units, Length: 196, dtype: int64

In [474]:
# Unique values in total_units
df_no_dups['total_units'].value_counts(dropna=False)

1       877261
2       373544
0       336570
3       128385
4        32598
         ...
551          1
361          1
955          1
1091         1
2039         1
Name: total_units, Length: 547, dtype: int64

In [475]:
# Unique values in land_square_feet
df_no_dups['land_square_feet'].value_counts(dropna=False)

     0.00    638569
 1,975.00    117150
 2,000.00     86529
 2,500.00     79017
 4,000.00     64536
              ...
23,294.00         1
53,654.00         1
29,107.00         1
26,403.00         1
28,165.00         1
Name: land_square_feet, Length: 20159, dtype: int64

In [476]:
# Unique values in gross_square_feet
df_no_dups['gross_square_feet'].value_counts(dropna=False)

      0.00    667472
  1,346.00    116247
112,850.00      9221
  2,400.00      9029
  3,000.00      8058
               ...
191,330.00         1
 78,474.00         1
158,456.00         1
 23,870.00         1
  7,318.00         1
Name: gross_square_feet, Length: 23879, dtype: int64

In [477]:
# Unique values in sale_price
df_no_dups['sale_price'].value_counts(dropna=False)

         0.00    545197
        10.00     14450
   450,000.00      9580
   400,000.00      9361
   550,000.00      8717
                  ...
   462,157.00         1
   423,343.00         1
20,863,475.00         1
   172,996.00         1
   226,173.00         1
Name: sale_price, Length: 106971, dtype: int64

In [478]:
# Unique values in sale_price_flag
df_no_dups['sale_price_flag'].value_counts(dropna=False)

nan                 1292443
transf_ownership     545197
Name: sale_price_flag, dtype: int64

In [479]:
# Unique values in borough_name
df_no_dups['borough_name'].value_counts(dropna=False)

Queens           573572
Brooklyn         514912
Manhattan        427278
Staten Island    170192
Bronx            151686
Name: borough_name, dtype: int64

## 08.1 Further cleaning to address inconsistencies

Inconsistencies in apartment_number will not be addressed as the column won't be relevant for the analysis.

Further cleaning will be done on:

tax_class_at present: nan, empty values and NaN will be merged to NaN. However, as the variable is time-variant and it cannot be guaranteed that the information provided is accurate at the time of the analysis, it is generally better not to work too much with this column, but with tax_class_at_time_of_sale instead as this variable is time-invariant.

easement: values of n and empty values will be merged to NaN.

year_built: To remain consistent with handling missing values in year_built earlier, rows with 0 for year_built will be dropped (ca. 9% of all rows).

In [480]:
# In tax_class_at_present replace nan with NaN
df_no_dups['tax_class_at_present'] = df_no_dups['tax_class_at_present'].replace('nan','NaN')

In [481]:
# In tax_class_at_present replace empty values with NaN
df_no_dups['tax_class_at_present'] = df_no_dups['tax_class_at_present'].replace(r'^\s*$','NaN', regex=True)

In [482]:
# Check unique values in tax_class_at_present again
df_no_dups['tax_class_at_present'].value_counts(dropna=False)

1      862920
2      635885
4      155892
2A      56813
2C      36147
1A      29433
NaN     19374
2B      18948
1B      18620
1C       2567
1D        922
3         119
Name: tax_class_at_present, dtype: int64

In [483]:
# In easement replace n with NaN
df_no_dups['easement'] = df_no_dups['easement'].replace('n','NaN')

In [484]:
# In easement replace empty values with NaN
df_no_dups['easement'] = df_no_dups['easement'].replace(r'^\s*$','NaN', regex=True)

In [485]:
# Check unique values in easement again
df_no_dups['easement'].value_counts(dropna=False)

NaN    1837627
E           13
Name: easement, dtype: int64

In [486]:
# Drop rows with year_built 0
df_no_dups = df_no_dups.loc[df_no_dups['year_built'] !=0]

In [487]:
# Check unique values in year_built again
df_no_dups['year_built'].value_counts(dropna=False)

1920    138609
1930    113022
1925     98003
1910     77412
1950     68378
         ...
1821         1
220          1
1030         1
1802         1
1648         1
Name: year_built, Length: 213, dtype: int64

In [488]:
# Get shape of df_no_dups (expected no. of rows: 1665736)
df_no_dups.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1665736 entries, 0 to 1916259
Data columns (total 23 columns):
 #   Column                          Non-Null Count    Dtype
---  ------                          --------------    -----
 0   borough_code                    1665736 non-null  object
 1   neighborhood                    1665736 non-null  object
 2   building_class_category         1665736 non-null  object
 3   tax_class_at_present            1665736 non-null  object
 4   block                           1665736 non-null  object
 5   lot                             1665736 non-null  object
 6   easement                        1665736 non-null  object
 7   building_class_at_present       1665736 non-null  object
 8   address                         1665736 non-null  object
 9   apartment_number                1665736 non-null  object
 10  zip_code                        1665736 non-null  int64
 11  residential_units               1665736 non-null  int64
 12  commercial_units                1665736 non-null  int64
 13  total_units                     1665736 non-null  int64
 14  land_square_feet                1665736 non-null  float64
 15  gross_square_feet               1665736 non-null  float64
 16  year_built                      1665736 non-null  int64
 17  tax_class_at_time_of_sale       1665736 non-null  object
 18  building_class_at_time_of_sale  1665736 non-null  object
 19  sale_price                      1665736 non-null  float64
 20  sale_date                       1665736 non-null  datetime64[ns]
 21  sale_price_flag                 1665736 non-null  object
 22  borough_name                    1665736 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(5), object(14)
memory usage: 305.0+ MB

# 09 Basic descriptive statistics I

In [489]:
# Change options for display of scientific notation
pd.options.display.float_format = '{:20,.2f}'.format

In [490]:
# Get minimum, maximum, mean and median for numeric columns
df_no_dups.describe()

,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,sale_price
count,"1,665,736.00","1,665,736.00","1,665,736.00","1,665,736.00","1,665,736.00","1,665,736.00","1,665,736.00","1,665,736.00"
mean,"10,863.51",2.51,0.24,2.76,"3,710.35","4,272.09","1,948.71","943,824.98"
std,594.52,34.43,7.74,35.39,"295,916.55","42,464.03",33.78,"11,588,090.64"
min,0.00,0.00,0.00,0.00,0.00,0.00,220.00,0.00
25%,"10,306.00",1.00,0.00,1.00,0.00,0.00,"1,925.00",0.00
50%,"11,211.00",1.00,0.00,1.00,"1,980.00","1,404.00","1,940.00","350,000.00"
75%,"11,361.00",2.00,0.00,2.00,"2,900.00","2,430.00","1,969.00","680,000.00"
max,"11,697.00","20,811.00","4,964.00","20,811.00","214,755,710.00","14,962,152.00","2,022.00","4,111,111,766.00"

year_built cannot be 220, this is likely erroneous data. Therefore, the row with year_built 202 will be dropped. Furthermore, as the first settlements along the Hudson were established in 1624 year_built cannot be lower than that. This is the lowest possible minimum year_built. All values below 1624 will therefore be dropped, too.

It is irritating that land_square_feet and gross_square_feet have minimum values of 0. The NYC Department of Finance glossary of terms says the following: 

Land square feet is "the land area of the property listed in square feet".
Gross square feet is "the total area of all the floors of a building as measured from the exterior surfaces of the outside walls of the building, including the land area and space within any building or structure on the property".

Hence, land_square_feet should always be greater than 0 and gross_square_feet should at minimum be equal to land_square_feet. This inconsistency is accepted for now, but will be further investigated at a later stage of the analysis.

In [491]:
# Get minimum sale_date
df_no_dups['sale_date'].min()

Timestamp('2003-01-01 00:00:00')

In [492]:
# Get maximum of sale_date
df_no_dups['sale_date'].max()

Timestamp('2023-03-31 00:00:00')

## 09.1 Further cleaning I based on insights from descriptive statistics

check how many rows with year below 1624; then create drop these rows if they're not too many; ensure resulting df has right shape

In [493]:
# Create df with year_built <1624
df_bad_year = df_no_dups.loc[df_no_dups['year_built'] <1624]

In [494]:
# Get shape of df_bad_year
df_bad_year.shape

(14, 23)

In [495]:
# Drop rows with year_built <1624
df_no_dups = df_no_dups.loc[df_no_dups['year_built'] >=1624]

In [496]:
# Get shape of df_no_dups (expected no. of rows: 1665722)
df_no_dups.shape

(1665722, 23)

# 10 Basic descriptive statistics II

In [497]:
# Get minimum, maximum, mean and median for numeric columns again
df_no_dups.describe()

,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,sale_price
count,"1,665,722.00","1,665,722.00","1,665,722.00","1,665,722.00","1,665,722.00","1,665,722.00","1,665,722.00","1,665,722.00"
mean,"10,863.51",2.51,0.24,2.76,"3,710.36","4,272.11","1,948.72","943,820.87"
std,594.52,34.43,7.74,35.39,"295,917.79","42,464.20",33.67,"11,588,136.56"
min,0.00,0.00,0.00,0.00,0.00,0.00,"1,648.00",0.00
25%,"10,306.00",1.00,0.00,1.00,0.00,0.00,"1,925.00",0.00
50%,"11,211.00",1.00,0.00,1.00,"1,980.00","1,404.00","1,940.00","350,000.00"
75%,"11,361.00",2.00,0.00,2.00,"2,900.00","2,430.00","1,969.00","680,000.00"
max,"11,697.00","20,811.00","4,964.00","20,811.00","214,755,710.00","14,962,152.00","2,022.00","4,111,111,766.00"

In [498]:
# Get info on df_no_dups
df_no_dups.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1665722 entries, 0 to 1916259
Data columns (total 23 columns):
 #   Column                          Non-Null Count    Dtype
---  ------                          --------------    -----
 0   borough_code                    1665722 non-null  object
 1   neighborhood                    1665722 non-null  object
 2   building_class_category         1665722 non-null  object
 3   tax_class_at_present            1665722 non-null  object
 4   block                           1665722 non-null  object
 5   lot                             1665722 non-null  object
 6   easement                        1665722 non-null  object
 7   building_class_at_present       1665722 non-null  object
 8   address                         1665722 non-null  object
 9   apartment_number                1665722 non-null  object
 10  zip_code                        1665722 non-null  int64
 11  residential_units               1665722 non-null  int64
 12  commercial_units                1665722 non-null  int64
 13  total_units                     1665722 non-null  int64
 14  land_square_feet                1665722 non-null  float64
 15  gross_square_feet               1665722 non-null  float64
 16  year_built                      1665722 non-null  int64
 17  tax_class_at_time_of_sale       1665722 non-null  object
 18  building_class_at_time_of_sale  1665722 non-null  object
 19  sale_price                      1665722 non-null  float64
 20  sale_date                       1665722 non-null  datetime64[ns]
 21  sale_price_flag                 1665722 non-null  object
 22  borough_name                    1665722 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(5), object(14)
memory usage: 305.0+ MB

# 11 Drop columns that are irrelevant for the analysis

In [499]:
# Drop all columns irrelevant to the ensuing analysis
df_no_dups_final = df_no_dups.drop(columns = ['block', 'lot', 'address', 'apartment_number', 'zip_code'])

In [500]:
# Get info on df_no_dups_final
df_no_dups_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1665722 entries, 0 to 1916259
Data columns (total 18 columns):
 #   Column                          Non-Null Count    Dtype
---  ------                          --------------    -----
 0   borough_code                    1665722 non-null  object
 1   neighborhood                    1665722 non-null  object
 2   building_class_category         1665722 non-null  object
 3   tax_class_at_present            1665722 non-null  object
 4   easement                        1665722 non-null  object
 5   building_class_at_present       1665722 non-null  object
 6   residential_units               1665722 non-null  int64
 7   commercial_units                1665722 non-null  int64
 8   total_units                     1665722 non-null  int64
 9   land_square_feet                1665722 non-null  float64
 10  gross_square_feet               1665722 non-null  float64
 11  year_built                      1665722 non-null  int64
 12  tax_class_at_time_of_sale       1665722 non-null  object
 13  building_class_at_time_of_sale  1665722 non-null  object
 14  sale_price                      1665722 non-null  float64
 15  sale_date                       1665722 non-null  datetime64[ns]
 16  sale_price_flag                 1665722 non-null  object
 17  borough_name                    1665722 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(4), object(10)
memory usage: 241.5+ MB

# 12 Export dataframes

In [501]:
# Define path2 for exporting
path2 = r'/Users/DanielaDietmayr/Library/CloudStorage/OneDrive-Personal/2023-05-07_NYC property sales/02_Data/02_Prepared data'

In [502]:
# Export df_no_dups_final as csv file
df_no_dups_final.to_csv(os.path.join(path2, '2023-05-14_df.csv'), index=False)

In [503]:
# Export df_no_dups_final as pickle file
df_no_dups_final.to_pickle(os.path.join(path2, '2023-05-14_df.pkl'))